"""
    ! Фреймворк !
Це Набір інструментів на вирішення конкретного класу завдань називають .
Це набір інструментів, бібліотек та правил,
які допомагають розробникам створювати програмне забезпечення швидше та ефективніше.
Саме для реалізації веб-застосунків — вебфреймворк.
Django — це високорівневий вебфреймворк, який заохочує швидку розробку та чистий, прагматичний дизайн.
Він був розроблений для того, щоб допомогти розробникам створювати складні, базовані на базі даних веб-сайти.
Django надає безліч вбудованих функцій, таких як
- аутентифікація користувачів,
- панель адміністратора,
- інтернаціоналізація
та багато іншого, що дозволяє розробникам зосередитися на написанні унікального коду для своїх проектів.
"""
#========================================================================================
"""
Архітектурно вебфреймворки можна розділити на:
- Model-view-controller (MVC).
- Single-page application (SPA).
- Багаторівнева організація.
"""
#========================================================================================
"""
    ! Model-view-controller (MVC) !
це архітектурний шаблон, який розділяє програму на три основні компоненти:
- Модель (Model):
    Відповідає за управління даними та логікою бізнесу.
    Модель взаємодіє з базою даних та визначає структуру даних.
- Представлення (View):
    Відповідає за відображення даних користувачу.
    Представлення отримує дані від моделі та формує інтерфейс користувача.
- Контролер (Controller):
    Відповідає за обробку користувацьких запитів та взаємодію між моделлю та представленням.
    Контролер отримує запити від користувача, обробляє їх, взаємодіє з моделлю
    для отримання даних та передає їх представленням для відображення.
Цей шаблон допомагає розділити логіку програми на окремі компоненти,
що полегшує розробку, тестування та підтримку коду.
"""
#========================================================================================
"""
    ! Створення проекту Django !

Для створення проекту Django, виконайте наступні кроки:
1. Встановіть Django, якщо він ще не встановлений: pip install django
2. Створіть новий проект за допомогою команди: django-admin startproject myproject
Ця команда створить папку myproject, яка містить структуру проекту Django поточному розташуванні.

myproject/
    manage.py
    mysite/
        __init__.py
        settings.py
        urls.py
        asgi.py
        wsgi.py

manage.py — відповідає за взаємодію із застосунком через термінал;
mysite/settings.py — містить налаштування застосунку;
mysite/urls.py — модуль, де описані всі URL-адреси і
    як вони повинні вирішуватися, відповідає за роутинг застосунку;
mysite/asgi.py та mysite/wsgi.py — є точками входу для ASGI та WSGI веб -серверів для роботи з застосунком Django.

3. Перейдіть до каталогу проекту: cd myproject
4. Запустіть сервер розробки: python manage.py runserver
5. Відкрийте веб-браузер і перейдіть за адресою http://127.0.0.1:8000/
    у вашому браузері, щоб побачити стартову сторінку Django.
6. Створіть новий додаток (app) за допомогою команди: python manage.py startapp myapp
7. Додайте ваш додаток до налаштувань проекту (myproject/settings.py) у списку INSTALLED_APPS.
8. Створіть моделі, представлення та шаблони для вашого додатку,
    щоб реалізувати функціональність вашого веб-сайту.
9. Використовуйте систему маршрутизації Django для визначення URL-адрес
    та зв'язування їх з відповідними представленнями.
10. Запустіть сервер розробки знову, щоб побачити зміни на вашому веб-сайті.
Це базові кроки для створення проекту Django.
Залежно від ваших потреб, ви можете додавати додаткові функції та налаштування до вашого проекту.
"""
#========================================================================================
"""
! Створення web-застосунку !

Для створення web-застосунку за допомогою Django, виконайте наступні кроки:
1. Створіть новий проект Django, якщо ви ще не зробили це: django-admin startproject myproject
2. Перейдіть до каталогу проекту: cd myproject
3. Запустіть сервер розробки: python manage.py runserver
4. Відкрийте веб-браузер і перейдіть за адресою http://127.0.0.1:8000/
у вашому браузері, щоб побачити стартову сторінку Django.
5. Створіть новий додаток (app) за допомогою команди: python manage.py startapp myapp
6. Додайте ваш додаток до налаштувань проекту (myproject/settings.py) у списку INSTALLED_APPS.
7. Створіть моделі, представлення та шаблони для вашого додатку, щоб реалізувати функціональність вашого веб-сайту.
8. Використовуйте систему маршрутизації Django для визначення URL-адрес та зв'язування їх з відповідними представленнями.
9. Запустіть сервер розробки знову, щоб побачити зміни на вашому веб-сайті.
Це базові кроки для створення web-застосунку за допомогою Django.
Залежно від ваших потреб, ви можете додавати додаткові функції та налаштування до вашого застосунку.
"""
#========================================================================================
"""
python manage.py startapp polls

polls/
    __init__.py
    admin.py
    apps.py
    migrations/
        __init__.py
    models.py
    tests.py
    views.py

"""
#========================================================================================
"""
    Мінімальний правильний порядок роботи
-Створи проєкт startproject
    django-admin startproject mysite
-Перейди у папку з manage.py
-Створи app startapp polls
    python manage.py startapp polls
-Додай polls у INSTALLED_APPS
    mysite/settings.py
-Виконай check
-Запусти runserver
    python manage.py runserver
    http://localhost:8000/polls/

    Практичний результат
-писати код у polls/views.py
-створити polls/urls.py
-підключити маршрути до mysite/urls.py
-працювати з моделями в models.py і міграціями
    python manage.py makemigrations polls
    python manage.py migrate
-змінити налаштування роботи з базою даних
    mysite/settings.py

Admin панель в Django
-Створити суперкористувача
    python manage.py createsuperuser
-Запустити runserver
    python manage.py runserver
    admin/http://localhost:8000/
    http://127.0.0.1:8000/admin/
"""
#========================================================================================
