#!  WebSocket !
# це протокол зв'язку, який забезпечує двосторонній зв'язок між клієнтом і сервером через єдине TCP-з'єднання.
# Він дозволяє обмінюватися даними в реальному часі без необхідності постійного відкриття нових з'єднань, що робить його ідеальним для застосувань, які потребують швидкого обміну інформацією, таких як чат-додатки, онлайн-ігри та фінансові платформи.
# =============================================================================================
# pip install websockets
# =============================================================================================
#!Приклад 1!
# директорія : websockets_exemple/exmpl_1
# *server.py
# *client.py
# =============================================================================================
# Запустіть server.py у одному терміналі, а потім запустіть client.py у іншому терміналі. Введіть своє ім'я в клієнті, і ви побачите відповідь від сервера.
# =============================================================================================
# =============================================================================================
# ! WebSockets робота з браузером !
# Для роботи з WebSockets у браузері можна використовувати JavaScript.
# Ось приклад клієнтського коду, який підключається до WebSocket-сервера і обмінюється повідомленнями:
# =============================================================================================
#!Приклад 2!
# директорія : websockets_exemple/exmpl_2
# *server.py
# *index.html
# =============================================================================================
# Запустіть server.py у терміналі, а потім відкрийте index.html у браузері. Введіть повідомлення в текстове поле і натисніть кнопку "Send". Ви побачите відповідь від сервера під текстовим полем.
# =============================================================================================
# =============================================================================================
#!Приклад 3!
# директорія : websockets_exemple/exmpl_3
# *server.py
# *consumer.py
# *producer.py
"""
    WebSockets — з постійним з'єднанням
consumer.py — який буде слухати та отримувати повідомлення від сервера Websocket
producer.py — який надсилає повідомлення на сервер
server.py — власне сам Websocket сервер, який пам'ятатиме про свої підключення
"""
# =============================================================================================
# Запустіть server.py у одному терміналі, producer.py у другому терміналі, а потім запустіть consumer.py у третьому терміналі. Ви побачите повідомлення, які надсилаються з producer.py і отримуються в consumer.py через server.py.
# =============================================================================================
"""
Створюємо найпростіший чат на WebSockets
У цьому прикладі ми створимо простий чат-сервер, який дозволяє клієнтам підключатися та обмінюватися повідомленнями в реальному часі. 
Ми будемо використовувати бібліотеку `websockets` для реалізації WebSocket-сервера.
"""
# =============================================================================================
#!Приклад 4!
# директорія : websockets_exemple/exmpl_4
# *server.py
# *index.html
# *main.css
# *main.js
# =============================================================================================
# Запустіть server.py у терміналі, а потім відкрийте index.html у браузері. Ви можете відкрити кілька вкладок з index.html, щоб імітувати кілька клієнтів. Введіть повідомлення в текстове поле і натисніть кнопку "Send". Ви побачите, що повідомлення відображаються на всіх відкритих вкладках, що демонструє роботу чату в реальному часі.
# =============================================================================================
