"""
    # ! Asynchronous model !
Асинхронне програмування - це парадигма програмування, яка дозволяє виконувати кілька завдань одночасно, не блокуючи основний потік виконання.
Це особливо корисно для задач, які вимагають великої кількості вводу/виводу (I/O), таких як мережеві запити або робота з файлами.
Асинхронне програмування базується на концепції подій та зворотних викликів (callbacks), а також використовує цикл подій (Event loop) для управління виконанням завдань.
"""

# =============================================================================================
