"""
    ! JSON, або JavaScript Object Notation! 
є текстовим форматом для представлення структурованих даних на основі синтаксису об'єктів мови програмування JavaScript.
"""
#===================================================================================================
"""
Синтаксис JSON базується на двох структурних елементах: об'єкти та масиви.

У JSON, об'єкти представляються у вигляді пар "ключ-значення" і огортаються у фігурні дужки {}. 
Ключі мають бути рядками (текстом у подвійних лапках), а значення можуть бути рядками, числами, масивами, логічними значеннями, іншими об'єктами або навіть значенням null (це значення None для Python). Кожна пара "ключ-значення" відділяється комою.
"""
#===================================================================================================
"""
Модуль json: 
*dict перетворює в об’єкти JSON,
*Список і кортеж перетворюються в масив JSON.
*Рядок Python перетворюється на рядок JSON.
*Цілі числа та дійсні числа перетворюються на числа JSON.
*Логічне значення True перетворюється на константу JSON true.
*Логічне значення False перетворюється на константу JSON false.
*None перетворюється на константу JSON null.
"""
#===================================================================================================
from sympy import true
import json

# Приклад JSON об'єкта
json_object = '''{
    "name": "Gupalo Vasyl",
    "age": 30,
    "isStudent": true
}'''
data = json.loads(json_object)
print(data["name"])  # Виведе: Gupalo Vasyl 
#===================================================================================================
data = {
    "name": "Gupalo Vasyl",
    "age": 30,
    "isStudent": True
}
json_data = json.dumps(data)
print(json_data)

#===================================================================================================
import json

some_data = {
    "key": "value",
    2: [1, 2, 3],
    "my_tuple": (5, 6),
    "my_dict": {"key": "value"},
}

json_string = json.dumps(some_data)
print(json_string)
unpacked_some_data = json.loads(json_string)
print(unpacked_some_data)

#===================================================================================================
    # Серіалізація об'єкта Python у рядок формату JSON
import json

# Python об'єкт (словник)
data = {"name": "Gupalo Vasyl", "age": 30, "isStudent": True}

# Серіалізація у файл
with open("data.json", "w", encoding="utf-8") as f:
    json.dump(data, f)

#===================================================================================================
    # Десеріалізація об'єкта Python з рядка формату JSON
import json

# Десеріалізація з файлу
with open("data.json", "r", encoding="utf-8") as f:
    data_from_file = json.load(f)
    print(data_from_file)

#===================================================================================================
import json

# Python об'єкт (словник)
data = {"name": "Гупало Василь", "age": 30, "isStudent": True}

# Серіалізація у файл
with open("data.json", "w", encoding="utf-8") as f:
    json.dump(data, f)
#===================================================================================================
import json

# Python об'єкт (словник)
data = {"name": "Гупало Василь", "age": 30, "isStudent": True}

# Серіалізація у файл
with open("data.json", "w", encoding="utf-8") as f:
    json.dump(data, f, ensure_ascii=False, indent=4)

#===================================================================================================
