"""
    ! Серіалізація об'єктів в Python ! 
Це процес перетворення структури даних або об'єкта в потік байтів для зберігання або передачі. 
Цей потік байтів може бути збережений у файлі, переданий через мережу або навіть використаний для зберігання в базі даних. 
Ціль (мета) серіалізації — зберегти стан об'єкта так, щоб його можна було відновити в майбутньому. 
Процес відновлення стану об'єкта з серіалізованої форми називається десеріалізацією.
"""
#===================================================================================================

expenses = {"hotel": 150, "breakfast": 30, "taxi": 15, "lunch": 20}

file_name = "expenses.txt"
with open(file_name, "w") as fh:
    for key, value in expenses.items():
        fh.write(f"{key}|{value}\n")
#===================================================================================================
"""
Python надає декілька модулів для серіалізації, найпопулярнішими з яких є pickle і json.
Модуль pickle є специфічним для Python і дозволяє серіалізувати та десеріалізувати практично будь-який об'єкт Python.

Переваги та обмеження:
- вбудований пакет pickle дозволяє працювати з вбудованими типами даних 
(словники, списки, кортежі, рядки, множини та ін.) і навіть з нескладними класами;
- формат JSON підтримується Python і з невеликими обмеженнями дозволяє працювати з 
словниками, списками, кортежами, рядками, числами.

Обидва ці методи мають свої переваги та обмеження. 
- Pickle має високу гнучкість і дозволяє серіалізувати складні об'єкти, але може бути небезпечним при десеріалізації даних зі сторонніх джерел. 
- JSON є більш обмеженим у типах даних, які можуть бути серіалізовані, але забезпечує кращу багатоплатформову сумісність і безпеку.

JSON не може безпосередньо серіалізувати власні класи без попереднього перетворення.
"""
#===================================================================================================
