"""
    #! Модель OSI (Open System Interconnection reference model) !
OSI (Референтна модель Відкритої Системи Взаємозв'язку - еталонна модель взаємодії відкритих систем) — В 1984 році International Standards Organization (ISO)
"""

# ====================================================================================================
"""
Модель OSI (Open Systems Interconnection) — це еталонна 7-рівнева модель взаємодії мережевих систем, розроблена International Organization for Standardization (ISO).

У моделі OSI мережеві функції розподілені між 7 рівнями. 
Кожному рівню відповідають різні мережеві операції, обладнання та протоколи.
"""
# ====================================================================================================
"""
Знизу вгору:
Please Do Not Throw Sausage Pizza Away
(P D N T S P A)

1️⃣ Physical Layer (Фізичний рівень)
🔹 Приклад: Ethernet кабель, Wi-Fi сигнал.
2️⃣ Data Link Layer (Канальний рівень)
🔹 Протокол: Ethernet
🔹 Пристрій: Switch
3️⃣ Network Layer (Мережевий рівень)
🔹 Протокол: IP
🔹 Пристрій: Router
4️⃣ Transport Layer (Транспортний рівень)
🔹 TCP = веб, файли
🔹 UDP = відео, ігри
5️⃣ Session Layer (Сеансовий рівень)
🔹 На практиці майже "розмитий" — часто інтегрований у протоколи верхніх рівнів.
6️⃣ Presentation Layer (Рівень представлення)
🔹 HTTPS працює тут.
7️⃣ Application Layer (Прикладний рівень)
🔹 Це рівень, де працює браузер, email-клієнт, API.

"""
# ====================================================================================================
"""
🧠 Як це виглядає при відкритті сайту
Коли ти заходиш на сайт:
L7 → браузер формує HTTP запит
L6 → TLS шифрує
L4 → TCP створює з’єднання
L3 → IP знаходить сервер
L2 → MAC передає фрейм
L1 → біти летять кабелем
"""
# ====================================================================================================
"""
Критично важливі	Менш важливі
L3 – IP	            L5 – Session
L4 – TCP/UDP	    L6 – Presentation
L7 – HTTP/DNS	    L1 – фізика сигналу
L2 – MAC/Switch
"""
# ====================================================================================================
