"""
Основні можливості Scrapy:
*асинхронність (значне зростання продуктивності);
    (робить запити з деяким інтервалом, немов імітуючи поведінку реального користувача)
*автоматична робота із заголовками запитів та куками;
*"ощадливий" скрапінг;
*імітація браузера зазначеної версії у заголовках запиту;
*інструменти для побудови складних багаторівневих схем обробки зібраних даних (очищення, валідація, форматування, збереження в базу даних тощо);
*власний інструмент тестування.

Scrapy надає потужний фреймворк для витягування, обробки та зберігання даних.
"""
# ===============================================================================================
"""
pip install Scrapy
або
poetry add Scrapy
scrapy shell
---------------------------
>>> url = 'https://quotes.toscrape.com/'
>>> fetch(url)
# Виведе HTML код сторінки
---------------------------
response.xpath("/html//small[@class='author']/text()").extract()
# Виведе список авторів цитат
---------------------------
"""
# ===============================================================================================
    # !Створення проекту Scrapy!
# ===============================================================================================
"""
scrapy startproject test_spyder

.
└── test_spyder
    ├── scrapy.cfg
    └── test_spyder
        ├── __init__.py
        ├── items.py
        ├── middlewares.py
        ├── pipelines.py
        ├── settings.py
        └── spiders
            └── __init__.py
---------------------------
cd test_spyder
"""

