"""
! RDb (Relational Database) нереляційна база даних !
    це тип бази даних, який організовує дані у вигляді таблиць з рядками і стовпцями,
    де кожен рядок представляє запис, а кожен стовпець представляє атрибут.
    RDb використовують SQL (Structured Query Language) для управління даними і забезпечують підтримку транзакцій,
    що дозволяє виконувати кілька операцій як єдину логічну одиницю роботи.
#===============================================================================================
    RDb лежать у виконанні принципів ACID:
- Atomicity (атомарність):
    кожна транзакція є неділимою одиницею роботи, яка виконується повністю або не виконується взагалі.
- Consistency (послідовність):
    кожна транзакція переводить базу даних з одного коректного стану в інший, забезпечуючи цілісність даних.
- Isolation (ізоляція):
    кожна транзакція виконується незалежно одна від одної, і їх результати не впливають на інші транзакції, що виконуються одночасно.
- Durability (надійність):
після завершення транзакції її результати зберігаються в базі даних і не можуть бути втрачені навіть у випадку збою системи.

    NoSQL бази даних не завжди дотримуються принципів ACID,
оскільки вони можуть бути оптимізовані для масштабування та продуктивності,
а не для забезпечення строгих гарантій транзакцій.
Замість цього, NoSQL бази даних часто використовують інші моделі консистентності,
такі як eventual consistency (кінцева консистентність),
яка дозволяє деякі затримки в оновленні даних, але забезпечує високу доступність і масштабованість.
"""
#===============================================================================================
"""
Теорема CAP (також відома як теорема Брюера) стверджує,
що в розподіленій системі неможливо одночасно забезпечити всі три наступні властивості:
- Consistency (послідовність):
    всі вузли системи бачать однакові дані в один і той же час.
- Availability (доступність):
    кожен запит до системи отримує відповідь, навіть якщо деякі вузли недоступні.
- Partition Tolerance (толерантність до розділення):
    система продовжує працювати, навіть якщо відбувається розділення мережі, що призводить до недоступності деяких вузлів.

Згідно з теоремою CAP, розподілена система може забезпечити лише дві з цих трьох властивостей одночасно.
Це означає, що розробники систем повинні робити вибір між цими властивостями залежно від конкретних вимог і сценаріїв використання.
Наприклад,
якщо система вибирає Consistency і Availability,
    вона може не бути толерантною до розділення, що означає,
    що вона може стати недоступною в разі розділення мережі.
Якщо система вибирає Consistency і Partition Tolerance,
    вона може не бути доступною, коли деякі вузли недоступні.
Якщо система вибирає Availability і Partition Tolerance,
    вона може не забезпечувати послідовність даних.
"""
#===============================================================================================
"""
NoSQL технології були народжені з метою вирішення проблеми стійкості до поділу,
тобто ефективно працювати на кластерах.
"""
#===============================================================================================
"""
Типи NoSQL баз даних:
- Key-Value:
    зберігають дані у вигляді пар ключ-значення, де ключ є унікальним і використовується для доступу до відповідного значення.
    Приклад: Memcached, Redis, Riak.
- Document-Oriented:
    зберігають дані у вигляді документів, які можуть мати складну структуру і підтримують різні типи даних.
    Приклад: MongoDB, CouchDB.
- Object Db:
    зберігають дані у вигляді об'єктів, які можуть мати складну структуру і підтримують різні типи даних.
    Приклад: Realm, db4o, ObjectDB.
- Wide Column Store:
    зберігають дані у вигляді таблиць з рядками і стовпцями, де кожен рядок може мати різну кількість стовпців.
    Приклад: Amazon DynamoDB, Apache Accumulo, Apache Cassandra, HBase.
- Column-Family:
    використовують таблицю з рядками і стовпцями, де кожен рядок може мати різну кількість стовпців.
    Приклад: Apache Cassandra, HBase.
- Graph:
    зберігають дані у вигляді графів, де вузли представляють об'єкти, а ребра представляють зв'язки між ними.
    Приклад: Neo4j, Amazon Neptune.
"""
#===============================================================================================
