"""
Оскільки пакет у Python — це директорії з файлами-модулями, ми можемо створити окрему директорію для пакетів-залежностей всередині кожного проєкту. Якщо вказати Python, що працюючи в директорії проєкту, імпортувати пакети потрібно саме з цієї директорії, то тоді ми зможемо ізолювати в операційній системі наші проєкти один від одного. Така директорія з пакетами-залежностями — це і є віртуальне оточення.

☝ Віртуальне оточення - це ізольоване середовище для Python проєктів. 
Використовуючи віртуальне оточення, можна встановлювати бібліотеки та їхні залежності в межах цього середовища, не впливаючи на глобальне середовище Python або на інші віртуальні оточення.
"""
#=========================================================================================
"""
 ## Щоб створити нове віртуальне оточення, виконайте наступні кроки:

1.Відкрийте термінал або командний рядок.
2.Перейдіть до директорії, де ви хочете створити свій Python проєкт.
3.Виконайте наступну команду для створення віртуального оточення:

! Рядок в терміналі: python -m venv .venv 
!                    python -m venv <venv-name>
Це створить директорію .venv у поточній директорії, яка міститиме віртуальне оточення.
"""
#=========================================================================================
"""
Щоб почати використовувати Python з віртуального оточення, виконайте активацію віртуального оточення. 
Для активації віртуального оточення, використовуйте одну з наступних команд, в залежності від вашої системи та командного інтерпретатора:

На Windows у командному рядку (CMD): .\.venv\Scripts\activate.bat

На Windows у PowerShell: .\.venv\Scripts\Activate.ps1

На macOS та Linux: source .venv/bin/activate
"""
#=========================================================================================
"""
Варіант 1: Якщо це звичайний командний рядок (Command Prompt / cmd)
Введіть цю команду і натисніть Enter:
!cmd: .venv\Scripts\activate

Варіант 2: Якщо це PowerShell (часто використовується у VS Code)
Введіть цю команду:
PowerShell: .\.venv\Scripts\activate
"""
#=========================================================================================
"""
Після активації командний рядок зміниться, відображаючи назву віртуального оточення, це показує, що воно активне.

Наприклад для PowerShell під Windows виконання команди:
PS E:\example_joke> .\.venv\Scripts\Activate.ps1

Активує віртуальне середовище, і консоль змінить вигляд на такий:
(.venv) PS E:\example_joke>

Як бачимо, нам підказують (.venv), що зараз ми опинилися в віртуальному середовищі яке знаходиться в директорії .venv. Тепер після активації в цій консолі виклик python буде викликати не системний Python, а версію з директорії .venv зі своїми пакетами.
"""
#=========================================================================================
"""
Щоб встановити необхідні бібліотеки в межах цього віртуального оточення, 
використовуйте pip install:
!pip install package_name

Ці встановлені бібліотеки будуть ізольовані від глобального середовища Python.
"""
#=========================================================================================
"""
Щоб повернутися до системного Python, 
!виконайте в консолі: deactivate

Це поверне вас до глобального середовища Python.
Щоб видалити віртуальне оточення, достатньо фізично видалити директорію .venv з усім її вмістом в директорії проєкту.
"""
#=========================================================================================
"""
 виконаємо деактивацію віртуального оточення
 cmd:  deactivate
"""
#=========================================================================================
"""
як зрозуміти які пакети встановлені в нашому віртуальному середовищі? 
Для цього існує файл requirements.txt який використовується для визначення залежностей проєкту, тобто переліку пакетів, необхідних для його коректної роботи. 
"""
#=========================================================================================
"""
Ви можете автоматично згенерувати requirements.txt за допомогою pip. 
Для цього просто запустіть наступну команду у вашому віртуальному середовищі:

! pip freeze > requirements.txt

Ця команда створить файл requirements.txt зі списком усіх встановлених пакетів у вашому віртуальному середовищі та їхніх версій.
"""
#=========================================================================================
"""
Щоб встановити пакети, перелічені у requirements.txt, використовуйте команду:
!pip install -r requirements.txt
"""
#=========================================================================================
"""
📦example_prj
 ┣ 📂.venv
 ┃ ┣ 📂Include
 ┃ ┣ 📂Lib
 ┃ ┣ 📂Scripts
 ┃ ┗ 📜pyvenv.cfg
 ┣ 📜log.py
 ┣ 📜main.py
 ┣ 📜requirements.txt
 ┗ 📜test.py
"""
#
