# salary_calculations.py
def add_bonus(salary: int, bonus: int) -> int:
    return salary + bonus
print(add_bonus(1000, 200))  # Output: 1200
#=========================================================================================
"""
📦example_pkg
 ┣ 📂calculations
 ┃ ┗ 📜salary_calculations.py
 ┗ 📜main.py

"""
#=========================================================================================
# main.py
from calculations import salary_calculations

salary = 1000
bonus = 15
salary_with_bonus = salary_calculations.add_bonus(salary, bonus)
print(salary_with_bonus)  # 1015

#=========================================================================================
# main.py
from calculations.salary_calculations import add_bonus

salary = 1000
bonus = 15
salary_with_bonus = add_bonus(salary, bonus)
print(salary_with_bonus)  # 1015

#=========================================================================================
"""
У версіях Python до 3.3 в пакетах обов'язково потрібно було розмістити допоміжний файл __init__.py. Якщо цього не зробити, то Python не сприймав директорію як пакет та імпортувати з такої директорії нічого не міг. Зараз в цьому немає потреби, але часто такі файли створюються для зворотної сумісності зі старими версіями.

Файл __init__.py — це службовий файл, який інтерпретатор обов'язково виконає під час першого імпорту пакету. Таким чином, якщо вам потрібно виконати якісь дії під час імпорту пакету, ви можете прописати їх у __init__.py.

Зазвичай __init__.py — порожній і нічого не робить. Але, коли структура пакету не занадто проста і там багато модулів та/або пакетів, про які користувачеві знати не обов'язково, ви можете імпортувати те, що користувачеві потрібно, в __init__.py. У такому випадку користувач зможе вже у своєму коді прописати скорочені варіанти імпортів.
"""
#=========================================================================================
"""
 📦example_init
 ┣ 📂utility
 ┃ ┣ 📂dummy
 ┃ ┃ ┗ 📜functions.py
 ┃ ┣ 📂useful
 ┃ ┃ ┗ 📜functions.py
 ┃ ┗ 📜__init__.py
 ┗ 📜main.py
"""
#=========================================================================================
# useful/functions.py
def nice_function():
    """Do nothing, but document it.

    No, really, it doesn't do anything.
    """
    pass

#=========================================================================================
# dummy/functions.py
def not_bad(s: str) -> str:
    if s.find("not") == -1 or s.find("bad") == -1:
        return s
    else:
        return s.replace("not bad", "good")

#=========================================================================================
# variant 1: __init__.py
import utility

utility.useful.functions.nice_function()
utility.dummy.functions.not_bad("Test string")

#=========================================================================================
# variant 2: __init__.py
from utility.useful.functions import nice_function
from utility.dummy.functions import not_bad

__all__ = ['nice_function', 'not_bad']
# Now users can import directly from utility
#=========================================================================================
from utility import nice_function, not_bad

nice_function()
not_bad("Test string")

#=========================================================================================
from utility import *

nice_function()
not_bad("Test string")

#=========================================================================================
"""
Задача написати скрипт, який:

1. Під час запуску запитує в користувача ім'я;
2. Вітається з користувачем на ім'я;
3. Запитує чи не бажає користувач прочитати анекдот;
4. Якщо користувач відповідає "так", то видає випадковий рядок із файлу "jokes.txt" і повторює пункти 3 та 4;
5. Якщо відповідь "ні", то прощається на ім'я і завершує роботу.
"""
#=========================================================================================
"""
📦example_joke
 ┣ 📂joke
 ┃ ┣ 📜jokes.txt
 ┃ ┣ 📜jokes_handler.py
 ┃ ┗ 📜__init__.py
 ┗ 📜main.py
"""
#=========================================================================================
# Дивись у папці classwork/Cybersecurity/Python_Core_2.0/4. Модуль 4. Робота з файлами та модульна система/joke_handler.py
#=========================================================================================
