with open('raw_data.bin', 'wb') as fh:
    fh.write(b'Hello world!')
#===============================================================================
s = b'Hello!'
print(s[1])  # Виведе: 101 (це ASCII-код символу 'e')

#===============================================================================
"""
ASCII (American Standard Code for Information Interchange - Американський стандартний код для обміну інформацією) - це символьна кодова таблиця, яка використовується для представлення тексту в комп'ютерах, комунікаційному обладнанні та інших пристроях, що працюють з текстом. Кожен символ у таблиці ASCII відповідає певному числу.
"""
#===============================================================================
byte_string = b'Hello world!'
print(byte_string)  # Виведе: b'Hello world!'
#===============================================================================
byte_str = 'some text'.encode()
print(byte_str)

#===============================================================================
"""
str.encode(encoding="utf-8", errors="strict")

encoding - вказує метод кодування. По замовчуванню використовується 'utf-8', який підтримує велику кількість символів з різних мов.
errors - вказує, як обробляти помилки кодування. Наприклад, 'strict' для викидання винятку у випадку помилки, 'ignore' для ігнорування помилок або 'replace' для заміни неможливих для кодування символів на певний замінник (?).
"""
#===============================================================================
# Перетворення списку чисел у байт-рядок
numbers = [0, 128, 255]
byte_numbers = bytes(numbers)
print(byte_numbers)  
# Виведе байтове представлення чисел
# b'\x00\x80\xff'

#===============================================================================
for num in [127, 255, 156]:
  print(hex(num))

