fn main() {
    println!("Hello, world!");
}

//=========================================================================================

/*  
Створення Rust-проєкту (правильний спосіб)
⚠️ Rust не пишуть “вручну” — використовують Cargo

У VS Code напиши код, щоб створити новий проект під назвою "hello_rust":
cargo new hello_rust
cd hello_rust
code .

Структура появиться така:
hello_rust/
 ├─ Cargo.toml
 └─ src/
    └─ main.rs
*/

//=========================================================================================

/*
Щоб створити новий проект під назвою "exercise"
Напиши команду: cargo new exercise, потім перейди до цієї директорії за допомогою команди cd exercise, і відкрийте її в VS Code за допомогою команди code ..

cargo new exercise
cd exercise
code .
*/
//========================================================================================

/*
cargo run - для побудови та запуску виконуваного файлу
cargo build - для побудови виконуваного файлу без його запуску
cargo build --release - для побудови оптимізованого виконуваного файлу для релізу
cargo check - для перевірки коду на помилки компіляції без побудови виконуваного файлу
*/
//========================================================================================
/*
    !Коротка шпаргалка
Тип	                 Символ	Для чого
Однорядковий	     //	    Логіка
Багаторядковий	     /* */	Рідко
Документація	     ///	API, функції
Документація crate	 //!	Модулі
*/
//========================================================================================
/*
    !Коментарі
- Однорядкові коментарі починаються з // і продовжуються до кінця рядка. Вони використовуються для коротких пояснень або нотаток.
- Багаторядкові коментарі починаються з /* і закінчуються на */. Вони можуть охоплювати кілька рядків і використовуються для більш детальних пояснень або тимчасового вимкнення коду.
- Документаційні коментарі для API починаються з /// і використовуються для опису функцій, структур, та інших елементів коду. Вони можуть бути згенеровані в документацію за допомогою інструментів, таких як rustdoc.
- Документаційні коментарі для crate починаються з //! і використовуються для опису модулів або всього crate. Вони також можуть бути згенеровані в документацію.
*/
//========================================================================================

/* 
    !Документаційні коментарі
Документаційні коментарі починаються з /// і використовуються для опису функцій, структур, та інших елементів коду. Вони можуть бути згенеровані в документацію за допомогою інструментів, таких як rustdoc.
/// # Опис
/// **Важлива функція**
///
/// ## Параметри
/// - `a` — перше число
/// - `b` — друге число
================================
У /// можна:
# Заголовки
**жирний текст**
кодові блоки
приклади з assert!
*/
//========================================================================================

