#===============================================================
"""
Компілятор перетворює весь код програми в машинний код перед її виконанням. Цей процес відомий як компіляція. Після компіляції програма стає виконуваним файлом (*.exe), який може бути запущений на комп'ютері. Компіляція відбувається один раз, і після цього програму можна запускати без необхідності повторної компіляції, доки не відбудуться зміни у коді. Мови програмування, які використовують компілятори — це C, C++ і Rust.

Інтерпретатор перекладає код програми на машинний код під час її виконання, обробляючи код по рядках. Інтерпретатори не створюють виконуваних файлів; замість цього, вони читають і виконують код безпосередньо. А це означає, що програму потрібно інтерпретувати кожного разу при її запуску. Мови програмування, які використовують інтерпретатори, це Python, Ruby і PHP.
"""
#===============================================================
"""
Ми вивчаємо Python — це високорівнева інтерпретована мова програмування загального призначення з динамічною типізацією, стандартна бібліотека якої містить великий набір корисних функцій.

Створений Гвідо ван Россумом та вперше випущений у 1991 році, Python заслужив популярність завдяки своїй читабельності та простоті синтаксису, що дозволяє програмістам виражати концепції в меншій кількості коду порівняно з багатьма іншими мовами.
Python підтримує кілька парадигм програмування, включаючи об'єктно-орієнтоване, процедурне та функціональне програмування. Він широко використовується в різних сферах, таких як веб-розробка, наукові обчислення, штучний інтелект, аналіз даних, автоматизація та розробка програмного забезпечення."""
#===============================================================
"""
Рядки

Рядкові змінні — це впорядковані незмінні набори символів. "Впорядковані" означає, що можна звертатися до символів рядків за індексом, копіювати їх, порівнювати, шукати. "Незмінні" означає, що, одного разу створивши рядок, не можна змінити його вміст, можна тільки створити новий. Програмісти кажуть, що рядки є імутабельними, тобто після їх створення їхній вміст не може бути змінений.

Тип рядка у Python, зазначений як str, є одним із найбільш часто використовуваних типів даних і застосовується для зберігання текстової інформації. Рядки у Python можуть містити будь-який набір символів, включаючи букви, цифри, спеціальні символи та навіть емодзі.
"""
#===============================================================
"""
Основна операція, яка реалізована для рядків — це об'єднання рядків (конкатенація). Конкатенація рядків реалізована з використанням оператора додавання +. Якщо "додати" два або більше рядків, то в результаті отримаємо об'єднаний рядок. У прикладі нижче joined_string буде дорівнювати "Hello world!".
"""
#===============================================================
"""
Оператори та операнди в Python використовуються для формування виразів, які є частиною логіки програми. Оператори — визначають дію, операнди — те, з чим ця дія буде вчинена.

Операнд — це об'єкт, який маніпулюється оператором. Це може бути змінна, літерал (наприклад, число або рядок) або більш складний вираз. Наприклад, у виразі 5 + 3 5 і 3 є операндами.

Оператор — це символ або ключове слово, яке застосовується до операндів і виконує певну операцію. Вищезгаданий символ + є оператором додавання. Оператори можуть бути різних видів: арифметичні, порівняння, логічні тощо.
"""
#===============================================================
"""
Ще один оператор, який ми розглянемо — це залишок від ділення у Python. Він обчислюється за допомогою оператора %, відомого як оператор взяття залишку. Цей оператор ділить одне число на інше і повертає залишок від цього ділення.

Наприклад, вираз a % b поверне залишок від ділення a на b. Ось декілька прикладів:

10 % 3 поверне 1, оскільки 10 ділиться на 3 три рази із залишком 1.
15 % 4 поверне 3, бо 15 ділиться на 4 три рази із залишком 3.
7 % 5 поверне 2, оскільки 7 ділиться на 5 один раз із залишком 2.

Цей оператор часто використовується для перевірки на кратність, наприклад, визначаючи, є число парним чи непарним:

Якщо x % 2 дорівнює 0, тоді x є парним.
Якщо x % 2 дорівнює 1, тоді x є непарним.
"""
#===============================================================

# Введення (отримання даних)
ім_я = input("Введіть ваше ім'я: ")

# Перетворення (обробка даних)
вітання = f"Привіт, {ім_я}!"

# Виведення (виведення даних)
print(вітання)

#===============================================================
n = 5000

hours = n // (60 * 60)
minutes = (n - hours * 60 * 60) // 60
seconds = n - hours * 60 * 60 - minutes * 60
print(f"{hours}:{minutes}:{seconds}")

#=============================================================== 
a = float(input("Введіть сторону квадрата a: "))
P = 4 * a
print(f"Периметр квадрата дорівнює {P}")

#===============================================================
# Встановлюємо ціни на продукти
price_per_croissant = 1.04
price_per_glass = 0.34
price_per_coffee_pack = 4.42

# Кількість кожного продукту
num_croissants = int(input("Введіть кількість круасанів: "))
num_glasses = int(input("Введіть кількість склянок: "))
num_coffee_packs = int(input("Введіть кількість упаковок кави: "))

# Обчислення загальної вартості
total_cost = num_croissants * price_per_croissant + \
             num_glasses * price_per_glass + \
             num_coffee_packs * price_per_coffee_pack

# Визначаємо кількість повних доларів і центів
total_dollars = int(total_cost)
total_cents = int(total_cost * 100)

# Вивід результату
print(f"Загальна вартість у повних доларах: {total_dollars} доларів")
print(f"Загальна вартість у центах: {total_cents} центів")
#===============================================================