my_dict = {}
my_dict = {
    "name": "Alice",
    "age": 30,
    "city": "New York"
}
#==============================================================
my_dict = {"name": "Alice", "age": 25, "city": "New York"}
print(my_dict["name"])  # Виведе 'Alice'

#==============================================================
my_dict = {"name": "Alice", "age": 25, "city": "New York"}
print(my_dict["name"])  # Виведе 'Alice'
my_dict["age"] = 26  # Змінює вік на 26
my_dict["email"] = "alice@example.com"  # Додає нову пару ключ-значення
print(my_dict)

#==============================================================
del my_dict["age"]
print(my_dict)
# {'name': 'Alice', 'city': 'New York', 'email': 'alice@example.com'}

#==============================================================
print("name" in my_dict)
print("age" in my_dict)

#==============================================================
"""
Метод pop() видаляє пару ключ-значення за вказаним ключем і повертає значення.
Метод update() оновлює словник, додаючи пари ключ-значення з іншого словника.
Метод clear() очищає словник, видаляючи всі пари ключ-значення.
Метод copy() створює поверхневу копію словника.
Метод get() повертає значення за вказаним ключем, або None, якщо ключ не існує.

"""
#==============================================================
my_dict = {"name": "Alice", "age": 25}
age = my_dict.get("age")  # Поверне 25
gender = my_dict.get("gender")  # Поверне None, оскільки "gender" немає в словнику
print(age)

#==============================================================
my_dict = {"name": "Alice", "age": 25}
name = my_dict["name"]  # Поверне 'Alice'
gender = my_dict["gender"]  # Викличе KeyError, оскільки "gender" немає в словнику
