my_tuple = tuple()  # або
my_tuple = ()
#==============================================================
my_tuple = (1, 2, 3)
print(my_tuple[0])  # Виведе 1
print(my_tuple[1])  # Виведе 2  
#==============================================================
my_tuple = (1,)
print(type(my_tuple))  # Виведе <class 'tuple'>
#==============================================================
my_tuple = (1, "Hello", 3.14)
my_tuple = 1, "Hello", 3.14

#==============================================================
first_item = my_tuple[0]  # Отримати перший елемент
second_item = my_tuple[1]  # Отримати другий елемент
#==============================================================
points = {
    (0, 0): "O",
    (1, 1): "A",
    (2, 2): "B"
}
print(points[(1, 1)])  # Виведе "A"

