"""
    ! CRUD - Create, Read, Update, Delete ! (створення, читання, оновлення і вилучення)

CRUD - це абревіатура, яка описує основні операції, які можна виконувати з даними в базі даних. CRUD складається з чотирьох основних операцій:
1. Create (створення) - це операція, яка дозволяє створювати нові записи в базі даних. Наприклад, якщо у вас є таблиця користувачів, ви можете створити нового користувача, додавши його дані до таблиці.
2. Read (читання) - це операція, яка дозволяє читати дані з бази даних. Ви можете виконувати запити до бази даних, щоб отримати інформацію про користувачів, продукти або будь-які інші дані, які зберігаються в базі даних.
3. Update (оновлення) - це операція, яка дозволяє оновлювати існуючі записи в базі даних. Якщо у вас є запис, який потрібно змінити, ви можете виконати операцію оновлення, щоб змінити його дані.
4. Delete (видалення) - це операція, яка дозволяє видаляти записи з бази даних. Якщо у вас є запис, який більше не потрібен, ви можете виконати операцію видалення, щоб видалити його з бази даних.

CRUD є основою для роботи з базами даних і використовується в багатьох додатках, таких як веб-сайти, мобільні додатки та інші програми, які потребують зберігання та обробки даних. Використання CRUD дозволяє ефективно керувати даними та забезпечує зручний спосіб взаємодії з базою даних.
"""

# =================================================================================================
"""Дивися на файл rel_one_to_many.py для створення бази даних та моделей User і Article в папці ClassWork/project1/"""
# =================================================================================================
