# !Обмеження !
# ===================================================================================================
"""
*RIMARY KEY – первинний ключ (pk).
*UNIQUE KEY – унікальний ключ, має всі властивості первинного, але, при цьому, первинним не є.
*FOREIGN KEY – зовнішній ключ (fk). Для нас це зв'язок з іншою таблицею, а для сервера – це обмеження.
"""
# ===================================================================================================
"""
        # PRIMARY KEY (pk) 
# – це стовпець або набір стовпців, які однозначно ідентифікують кожен рядок у таблиці. Первинний ключ не може містити NULL-значення і повинен бути унікальним для кожного рядка. Він використовується для забезпечення цілісності даних і швидкого доступу до рядків таблиці.
"""
# ===================================================================================================
"""
ALTER TABLE table1 ADD CONSTRAINT table1_id_pk PRIMARY KEY (id);
-- додає первинний ключ з назвою table1_id_pk на стовпець id у таблиці table1, що забезпечує унікальність ідентифікаторів для кожного рядка в таблиці.
"""
# ===================================================================================================
"""
ALTER TABLE table1 DROP PRIMARY KEY;
-- видаляє первинний ключ з таблиці table1, що може вплинути на цілісність даних і швидкість доступу до рядків у таблиці.
"""
# ===================================================================================================
"""
        # UNIQUE KEY 
# – це стовпець або набір стовпців, які також повинні містити унікальні значення, але можуть містити NULL-значення. Унікальний ключ використовується для забезпечення того, що значення в певному стовпці або наборі стовпців не повторюються, але при цьому не є обов'язковими для кожного рядка.
"""
# ===================================================================================================
"""
CREATE TABLE persons (
    id INT PRIMARY KEY,
    email CHAR(50) NOT NULL,
    fullName varchar(100) NULL,
    CONSTRAINT persons_email_un UNIQUE KEY (email)
);
-- створює таблицю persons з трьома стовпцями: id, email та fullName. Стовпець id є первинним ключем, а стовпець email має унікальне обмеження, що гарантує, що всі значення в цьому стовпці будуть унікальними.
"""
# ===================================================================================================
"""
ALTER TABLE persons ADD CONSTRAINT persons_email_un UNIQUE KEY (email);
-- додає унікальне обмеження з назвою persons_email_un на стовпець email у таблиці persons, що гарантує, що всі значення в цьому стовпці будут унікальными.
"""
# ===================================================================================================
"""
        # FOREIGN KEY (fk) 
# – це стовпець або набір стовпців, які посилаються на первинний ключ іншої таблиці. Зовнішній ключ використовується для забезпечення цілісності даних між двома таблицями, гарантуючи, що значення в зовнішньому ключі відповідають значенням у первинному ключі іншої таблиці або є NULL.
"""
# ===================================================================================================
"""
CREATE TABLE genders (
  id INT PRIMARY KEY,
  name VARCHAR(30),
  created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);
-- створює таблицю genders з двома стовпцями: id та name. Стовпець id є первинним ключем, а стовпець name може містити NULL-значення.
"""
# ===================================================================================================
"""
CREATE TABLE users (
  id INT PRIMARY KEY,
  name VARCHAR(30),
  email VARCHAR(30),
  password VARCHAR(30),
  age TINYINT UNSIGNED,
  gender_id INT,
  created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
  FOREIGN KEY (gender_id) REFERENCES genders (id)
        ON DELETE SET NULL
        ON UPDATE CASCADE
);
-- створює таблицю users з кількома стовпцями, включаючи id, name, email, password, age, gender_id та created_at. Стовпець gender_id є зовнішнім ключем, що посилається на стовпець id у таблиці genders.
"""
# ===================================================================================================