# ===================================================================================================
#! Важливо: Використовуйте команди UPDATE, DELETE, TRUNCATE та DROP з обережністю, оскільки вони можуть призвести до втрати даних. Завжди рекомендується робити резервну копію даних перед виконанням таких операцій.
# ===================================================================================================
# ===================================================================================================
#! UPDATE !
# ===================================================================================================
"""
UPDATE contacts SET user_id = 3 WHERE id = 5; -- оновлює значення user_id на 3 для рядка, де id дорівнює 5.
"""
# ===================================================================================================
#! DELETE !
# ===================================================================================================
"""
DELETE FROM contacts WHERE id = 4; -- видаляє рядок з таблиці, де id дорівнює 4.
"""
# ===================================================================================================
"""
TRUNCATE TABLE contacts; -- видаляє всі дані з таблиці, але залишає структуру таблиці та її індекси.
"""
# ===================================================================================================
"""
DROP TABLE contacts; -- видаляє всю таблицю, включаючи її структуру та всі дані.
"""
# ===================================================================================================
