# ====================================================================================================
#! INDEXES !
# ====================================================================================================
# Індекси - це спеціальні структури даних, які використовуються для швидкого пошуку та доступу до даних у базі даних. Вони створюються на одному або декількох стовпцях таблиці і дозволяють базі даних швидко знаходити рядки, які відповідають певним умовам. Індекси можуть значно покращити продуктивність запитів, особливо при роботі з великими таблицями.

# Індекси можуть бути створені на будь-якому стовпці таблиці, але зазвичай вони створюються на стовпцях, які часто використовуються в умовах WHERE, JOIN або ORDER BY. Індекси можуть бути унікальними (UNIQUE), що означає, що значення в індексованому стовпці повинні бути унікальними, або неунікальними (NON-UNIQUE), що дозволяє повторювані значення.

# Індекси можуть бути створені за допомогою команди CREATE INDEX або як частина визначення таблиці при її створенні. Вони можуть значно покращити швидкість виконання запитів, але також можуть займати додатковий простір на диску і впливати на швидкість вставки, оновлення та видалення даних, оскільки індекси також потрібно оновлювати при зміні даних.
# ====================================================================================================
"""
CREATE INDEX fullname_ix ON users (fullname);
"""
# ===================================================================================================
"""
CREATE INDEX fullname_ix ON users (fullname);
-- створює індекс з назвою fullname_ix на стовпець fullname у таблиці users, що може покращити швидкість виконання запитів, які використовують цей стовпець.
"""
# ====================================================================================================
"""
#1. під час створення таблиці через оператор CREATE TABLE

CREATE TABLE table1
(
    id INT UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'Код товару',
    code char(4) NOT NULL DEFAULT 'AAAA',
    name VARCHAR(50) NOT NULL DEFAULT '' COMMENT 'Назва товару',
    description TEXT NOT NULL DEFAULT '' COMMENT 'Опис товару',
    price FLOAT NOT NULL DEFAULT 0 COMMENT 'Ціна товару',
    CONSTRAINT table1_id_pk PRIMARY KEY (id),
    INDEX table1_name_ix(name),
    INDEX table1_price_ix(price)
) COMMENT 'Таблиця товарів з ключами та індексами';
"""
# ====================================================================================================
"""
2. змінюючи таблицю через оператор ALTER TABLE

ALTER TABLE table1 ADD INDEX table1_name_ix(name), ADD INDEX table1_price_ix(price);
"""
# ===================================================================================================
"""
3. додати індекс через оператор CREATE INDEX

CREATE INDEX table1_name_ix ON table1 (name);
"""
# ===================================================================================================
"""
складені індекси

CREATE INDEX table1_name_price_ix ON table1 (name, price);
-- створює індекс з назвою table1_name_price_ix на стовпці name та price у таблиці table1, що може покращити швидкість виконання запитів, які використовують ці стовпці.
"""
# ===================================================================================================
"""
DROP INDEX table1_price_ix ON table1;
-- видаляє індекс з назвою table1_price_ix зі стовпця price у таблиці table1, що може вплинути на швидкість виконання запитів, які використовують цей стовпець.
"""
# ===================================================================================================
