"""
    ! База даних (БД) !
це набір з однієї та більше таблиць з даними.
Кожна таблиця містить інформацію в 1 та більше стовпцях (полях).
Один елемент даних (запис) — це один рядок у таблиці.

Ключ — унікальне поле, яке однозначно ідентифікує запис.
Primary key — унікальний ключ, який не повторюється у таблиці.
Foreign key — посилання на унікальний ключ, який НЕ ПОВТОРЮЄТЬСЯ у своїй таблиці.
"""

# ====================================================================================================
"""
    !SQL (Structured Query Language)— мова структурованих запитів.
Основний інструмент спілкування з реляційними БД — SQL.
SQL використовується для створення, зміни та запиту баз даних.
SQL — це декларативна мова, що означає, що ви описуєте, що ви хочете отримати, а не як це зробити.
SQL складається з різних типів операторів, які можна використовувати для виконання різних дій.
"""
# ====================================================================================================
"""
SQL (Structured Query Language) — це мова програмування, яка використовується для управління реляційними базами даних.
Реляційна база даних — це база даних, яка зберігає дані у вигляді таблиць, які можуть бути пов'язані між собою за допомогою ключів.
SQL використовується для створення, зміни та запиту баз даних.
"""
# ====================================================================================================
"""
    ! Основні оператори SQL !
*1.Оператори визначення даних (Data Definition Language, DDL):
- CREATE створює об'єкт БД (саму базу, таблицю, представлення, користувача тощо),
- ALTER змінює об'єкт,
- DROP видаляє об'єкт;

*2.Оператори маніпуляції даними (Data Manipulation Language, DML):
- SELECT вибирає дані, що задовольняють заданим умовам,
- INSERT додає нові дані,
- UPDATE змінює існуючі дані,
- DELETE видаляє дані;

*3.Оператори визначення доступу до даних (Data Control Language, DCL):
- GRANT надає користувачеві (групі) дозволи на певні операції з об'єктом,
- REVOKE відкликає раніше видані дозволи,

*4.Оператори управління транзакціями (Transaction Control Language, TCL):
- COMMIT підтверджує зміни,астосовує транзакцію,
- ROLLBACK відкочує всі зміни, зроблені в контексті поточної транзакції,
- SAVEPOINT ділить транзакцію на дрібніші ділянки.
"""
# ===================================================================================================
