# ===================================================================================================
#! ALTER TABLE !
# ===================================================================================================
# - це команда, яка дозволяє змінювати структуру існуючої таблиці, наприклад, додавати або видаляти стовпці, змінювати тип даних стовпців тощо.
# ===================================================================================================
"""
ALTER TABLE table_name CHANGE column_a column_b INTEGER;
-- змінює назву стовпця column_a на column_b та встановлює його тип даних як INTEGER.
"""
# ===================================================================================================
"""
ALTER TABLE table_name MODIFY column_b BIGINT NOT NULL;
-- змінює тип даних стовпця column_b на BIGINT та встановлює його як NOT NULL 
(не допускає NULL значень).
"""
# ===================================================================================================
"""
ALTER TABLE table_name ADD column_c FLOAT;
-- додає новий стовпець column_c з типом даних FLOAT до таблиці table_name.
"""
# ===================================================================================================
"""
ALTER TABLE table_name ADD column_d VARCHAR(30) AFTER column_c;
-- додає новий стовпець column_d з типом даних VARCHAR(30) після стовпця column_c у таблиці table_name.
"""
# ===================================================================================================
"""
ALTER TABLE table_name ADD column_f CHAR(10) FIRST;
-- додає новий стовпець column_f з типом даних CHAR(10) на початок таблиці table_name.
"""
# ===================================================================================================
"""
ALTER TABLE table_name DROP COLUMN column_c;
-- видаляє стовпець column_c з таблиці table_name.
"""
# ===================================================================================================
"""
ALTER TABLE table_name ADD INDEX index_name_ix (column_b);
-- додає індекс з назвою index_name_ix на стовпець column_b у таблиці table_name, що може покращити швидкість виконання запитів, які використовують цей стовпець.
"""
# ===================================================================================================
