"""
Генератор в Python - це об'єкт, який використовується для лінивої (on-demand) генерації даних та дозволяє нам оголошувати функцію, яка може бути використана в циклі.

Генератор створюється за допомогою функції, яка повертає послідовність елементів один за одним, використовуючи yield, а не return.

Генератор виробляє елементи "на льоту" і обробляє один елемент за раз. Це дуже ефективно з точки зору використання пам'яті, особливо для великих даних. Коли генератор виробляє значення, його стан "заморожується", і виконання може бути продовжене з цього моменту при наступному виклику.

Генератори можна перебирати в циклі for або вручну за допомогою функції next().
"""
#===========================================================================================
def my_generator():
    yield 1
    yield 2
    yield 3


gen = my_generator()

# Використання next()
print(next(gen))  # Виведе 1
print(next(gen))  # Виведе 2
print(next(gen))  # Виведе 3

#===========================================================================================
def read_lines(file_path):
    with open(file_path, 'r', encoding="utf-8") as file:
        for line in file:
            yield line.strip()


# Використання генератора для читання рядків з файлу
for line in read_lines("my_file.txt"):
    print(line)
