print(0.1 + 0.2 == 0.3)  # False
print(0.1 + 0.2)  # 0.30000000000000004
#===========================================================================================
from decimal import Decimal

print(Decimal("0.1") + Decimal("0.2") == Decimal("0.3")) # True
print(Decimal("0.1") + Decimal("0.2"))  # 0.3

#===========================================================================================
from decimal import Decimal, getcontext

getcontext().prec = 6
print(Decimal("1") / Decimal("7"))  # 0.142857

getcontext().prec = 8
print(Decimal("1") / Decimal("7"))  # 0.14285714

#===========================================================================================
"""
☝ Визначення значущих цифр:
*Усі ненульові цифри є значущими: 1, 2, 3, 4, 5, 6, 7, 8, 9.
*Нулі між ненульовими цифрами значущі: 102, 2005, 50009.
*Провідні нулі ніколи не бувають значущими: 0,02; 001,887; 0,000515.
*В числі з десятковою або без десяткової коми знаходяться знакові нулі (праворуч від останньої ненульової цифри) за умови, якщо вони обґрунтовані точністю їх використання: 389,000; 2,02000; 5,400; 57,5400.
"""
#===========================================================================================
from decimal import Decimal, getcontext

getcontext().prec = 6
print(Decimal("233") / Decimal("7"))  # 33.2857

#===========================================================================================
from decimal import Decimal, ROUND_DOWN

# Вихідне число Decimal
number = Decimal('3.14159')

# Встановлення точності до двох знаків після коми
rounded_number = number.quantize(Decimal('0.00'), rounding=ROUND_DOWN)

print(rounded_number) # 3.14

#===========================================================================================
import decimal
from decimal import Decimal
 
number = Decimal("1.45")

# Округлення за замовчуванням до одного десяткового знаку
print("Округлення за замовчуванням ROUND_HALF_EVEN:", number.quantize(Decimal("0.0")))

# Округлення вверх при нічиї (ROUND_HALF_UP)
print("Округлення вгору ROUND_HALF_UP:", number.quantize(Decimal("0.0"), rounding=decimal.ROUND_HALF_UP))

# Округлення вниз (ROUND_FLOOR)
print("Округлення вниз ROUND_FLOOR:", number.quantize(Decimal("0.0"), rounding=decimal.ROUND_FLOOR))

# Округлення вверх (ROUND_CEILING)
print("Округлення вгору ROUND_CEILING:", number.quantize(Decimal("0.0"), rounding=decimal.ROUND_CEILING))

# Округлення до трьох десяткових знаків за замовчуванням
print("Округлення до трьох десяткових знаків:", Decimal("3.14159").quantize(Decimal("0.000")))

#===========================================================================================
"""
Decimal дозволяє вибирати різні режими округлення. Згідно з офіційною документацією Python, розглянемо основні режими:

* ROUND_FLOOR число завжди округляє до найближчого меншого значення, незалежно від знаку числа.
* ROUND_CEILING число завжди округляє до найближчого більшого значення, незалежно від знаку числа.
* ROUND_HALF_DOWN числа округлюються до найближчого значення. У випадку, коли число знаходиться точно посередині між двома можливими варіантами округлення (наприклад, 2,5, де можливі варіанти — 2 або 3), число округляється вниз, тобто до найближчого меншого значення.
* ROUND_HALF_UP числа округлюються до найближчого значення. Проте у випадку нічиї (коли число знаходиться точно посередині між двома варіантами), число округляється вгору, тобто до найближчого більшого значення.
* ROUND_UP число округляється від нуля. Це означає, що додатні числа округлюються до більшого, а від'ємні - до більшого за модулем значення.
* ROUND_DOWN число округляється до нуля. Тобто додатні числа округлюються до меншого, а від'ємні - до меншого за модулем значення.
* ROUND_HALF_EVEN числа округлюються до найближчого числа. Цей режим, також відомий як "банківське округлення", округлює число до найближчого значення, але у випадку нічиї (коли число точно посередині між двома варіантами), воно округляється до найближчого парного цілого числа. Наприклад, як 2.5 округлиться до 2, а 3.5 - до 4. Цей метод зменшує сукупну помилку при серії округлень.
"""


