        #Лямбда-функції 
"""
Буває, що нам потрібна функція, суть якої можна викликати, передавши їй аргументи, але сама функція дуже проста і її всю можна описати одним виразом. У таких ситуаціях немає особливого сенсу створювати функцію, використовуючи стандартний синтаксис і захаращувати простір імен.

Спеціально для таких випадків у Python є лямбда-функції, відомі також як анонімні функції, які є важливою частиною Python і використовуються для створення маленьких, однорядкових функцій.
"""
#==========================================================================================
#*lambda arguments: expression
#==========================================================================================
add = lambda x, y: x + y
print(add(5, 3))  # Виведе 8

print((lambda x, y: x + y)(5, 3))  # Виведе 8

#==========================================================================================
nums = [1, 2, 3, 4, 5]
nums_sorted = sorted(nums, key=lambda x: -x)
print(nums_sorted) # [5, 4, 3, 2, 1]
#==========================================================================================
#==========================================================================================
        #Функція map
"""
Функція map() є функцією вищого порядку, що означає, що вона приймає іншу функцію як аргумент. map() використовується для застосування заданої функції до кожного елемента об'єкта ітерації, наприклад списку, та повертає ітератор, який виробляє результати.
"""
#==========================================================================================
#==========================================================================================
"""
#*map(function, iterable, ...)
"""
#==========================================================================================
numbers = [1, 2, 3, 4, 5]

for i in map(lambda x: x ** 2, numbers):
    print(i)

#==========================================================================================
numbers = [1, 2, 3, 4, 5]

squared_nums = list(map(lambda x: x ** 2, numbers))
print(squared_nums) # [1, 4, 9, 16, 25]
#==========================================================================================
nums1 = [1, 2, 3]
nums2 = [4, 5, 6]
sum_nums = map(lambda x, y: x + y, nums1, nums2)

print(list(sum_nums)) # [5, 7, 9]

#==========================================================================================
        #*list comprehensions
nums1 = [1, 2, 3]
nums2 = [4, 5, 6]
sum_nums = [x + y for x, y in zip(nums1, nums2)]
print(sum_nums) # [5, 7, 9]

#==========================================================================================
numbers = [1, 2, 3, 4, 5]

squared_nums = list(map(lambda x: x ** 2, numbers))
print(squared_nums) # [1, 4, 9, 16, 25]

#==========================================================================================
        #*list comprehensions
nums = [1, 2, 3, 4, 5]

squared_nums = [x * x for x in nums]
print(squared_nums) # [1, 4, 9, 16, 25] 

#==========================================================================================
#==========================================================================================
        #Функція filter
"""
Функція filter() використовується для фільтрації об'єктів ітерації, таких як списки або кортежі, за допомогою заданої функції. Вона створює ітератор, який містить тільки ті елементи об'єкта ітерації, для яких функція-фільтр повертає True.

Нагадаємо, що у Python можна будь-який тип привести до boolean. До False приводяться 0, None та порожні контейнери. Рядки, списки, словники, множини, кортежі, всі інші випадки приводяться до True.
"""
#==========================================================================================
"""
#*filter(function, iterable)
"""
#==========================================================================================
even_nums = filter(lambda x: x % 2 == 0, range(1, 11))

print(list(even_nums)) # [2, 4, 6, 8, 10]
#==========================================================================================
        #*list comprehensions
nums = [1, 2, 3, 4, 5, 6]
even_nums = [x for x in nums if x % 2 == 0]
print(even_nums) # [2, 4, 6]
        
#==========================================================================================
def is_positive(x):
    return x > 0

nums = [-2, -1, 0, 1, 2]
positive_nums = filter(is_positive, nums)

print(list(positive_nums)) # [1, 2]

#==========================================================================================
some_str = 'Видавництво А-БА-БА-ГА-ЛА-МА-ГА'

new_str = ''.join(list(filter(lambda x: x.islower(), some_str)))
print(new_str) # идавництво
#==========================================================================================
        #*list comprehensions
some_str = 'Видавництво А-БА-БА-ГА-ЛА-МА-ГА'

new_str = ''.join([x for x in some_str if x.islower()])
print(new_str)

#==========================================================================================
#==========================================================================================
                # Функція any
"""
Функція any() є вбудованою функцією, яка повертає True, якщо хоча б один елемент із заданого об'єкта ітерації є істинним. Якщо об'єкт ітерації порожній або всі його елементи є хибними, то any() повертає False.
"""
#==========================================================================================
#==========================================================================================
nums = [0, False, 5, 0]
result = any(nums)  
print(result) # True

#==========================================================================================
        #*list comprehensions
nums = [1, 3, 5, 7, 9]
result = any(x % 2 == 0 for x in nums)  
print(result) # False

#==========================================================================================
#==========================================================================================
                #Функція all
"""
Функція all() є вбудованою функцією, яка повертає True, якщо всі елементи в переданому їй об'єкті ітерації є істинними - тобто не False, 0, "", None або будь-яке інше значення, яке Python оцінює як хибне. Але будьте уважні, якщо об'єкт ітерації порожній, функція all() повертає True.
"""
#==========================================================================================
#==========================================================================================
nums = [1, 2, 3, 4]
result = all(nums)  
print(result)  # True

#==========================================================================================
        #*list comprehensions
nums = [1, 2, 3, 4]
is_all_even = all(x % 2 == 0 for x in nums) 
print(is_all_even) # False

#==========================================================================================
words = ["Hello", "World", "Python"]
is_all_title_case = all(word.istitle() for word in words)
print(is_all_title_case) # True

#==========================================================================================


#==========================================================================================