#=====================================================================================================
    # *Патерни* #
#=====================================================================================================
"""
- Породжувальні патерни турбуються про гнучке створення об'єктів без внесення до програми зайвих залежностей.
- Структурні патерни показують різноманітні способи побудови зв'язків між об'єктами.
- Поведінкові патерни піклуються про ефективну комунікацію між об'єктами.
"""
#=====================================================================================================
"""
    ! Абстрактні класи (Клас інтерфейс)!
Це класи, призначені для наслідування, але уникають реалізації конкретних методів, залишаючи лише сигнатури методів, які повинні реалізовувати підкласи.
Це спосіб писати код, що самодокументується.
"""
#=====================================================================================================
    # *Наївна реалізація абстрактного класу
#=====================================================================================================
class MyABC:
    def foo(self):
        raise NotImplementedError()

    def bar(self):
        raise NotImplementedError()

#=====================================================================================================
class MyABC:
    def foo(self):
        raise NotImplementedError()

    def bar(self):
        raise NotImplementedError()

class ActualMy(MyABC):
    def foo(self):
        print('foo')

a = ActualMy()
a.foo()     # foo
a.bar()     # raises NotImplementedError
#=====================================================================================================
    # *Реалізація абстрактного класу за допомогою модуля abc
#=====================================================================================================
from abc import abstractmethod, ABCMeta

from attrs import Factory

class MyBaseClass(metaclass=ABCMeta):
    @abstractmethod
    def foo(self):
        pass

    @abstractmethod
    def baz(self):
        pass

class Child(MyBaseClass):
    pass

c = Child()  # TypeError: Can't instantiate abstract class Child with abstract methods baz, foo
#=====================================================================================================
"""
    ! Метакласи !
Це класи, екземпляри яких є класами. 
Щоб створити свій власний метаклас у Python, потрібно скористатися підкласом type, — стандартним метакласом у Python.
"""
#=====================================================================================================
ExampleClass = type('ExampleClass', (object,) , {'some_var': 1})

print(ExampleClass.__name__) # ExampleClass
print(ExampleClass.some_var) # 1
#=====================================================================================================
from abc import abstractmethod, ABC

class MyBaseClass(ABC):
    @abstractmethod
    def foo(self):
        pass

    @abstractmethod
    def baz(self):
        pass

class Child(MyBaseClass):
    pass

c = Child() # TypeError: Can't instantiate abstract class Child with abstract methods baz, foo
#=====================================================================================================
from abc import ABC, abstractmethod

class Document(ABC):
    @abstractmethod
    def generate(self, data):
        pass
#=====================================================================================================
