"""
    ! Програмна інженерія (Software Engineering) ! 
Це інженерна галузь, пов'язана з розробкою програмного продукту з використанням чітко визначених наукових принципів, методів та процедур. 
Результатом розробки програмного забезпечення є ефективний та надійний програмний продукт.
"""
#=====================================================================================================
"""
*DRY (Don't Repeat Yourself)* — принцип програмної інженерії, що закликає розробників уникати дублювання інформації в коді.
Замість того, щоб повторювати однаковий код у різних місцях, слід створювати функції, класи або модулі, які можна використовувати повторно.
*KISS (Keep It Simple, Stupid)* — принцип програмної інженерії, що наголошує на важливості простоти в дизайні та реалізації програмного забезпечення.
Складні рішення можуть бути важкими для розуміння, підтримки та масштабування, тому слід прагнути до максимальної простоти.
*YAGNI (You Aren't Gonna Need It)* — принцип програмної інженерії, що закликає розробників не додавати функціональність або складність у програмне забезпечення, якщо вона не є необхідною на даний момент.
Це допомагає уникнути перевантаження коду непотрібними елементами та зберігати фокус на поточних вимогах проекту.
"""
#=====================================================================================================
""" 
# Основні етапи розробки програмного забезпечення:
    # 1. Визначення вимог   (Requirements Engineering)
    # 2. Проектування       (Design)  
    # 3. Реалізація         (Implementation)
    # 4. Тестування         (Testing)
    # 5. Впровадження       (Deployment)
    # 6. Супровід           (Maintenance)
# Кожен з цих етапів є важливим для створення якісного програмного забезпечення, яке відповідає потребам користувачів та є надійним у використанні.
# Методології розробки програмного забезпечення:
    # 1. Водоспадна модель (Waterfall Model)
    # 2. Ітеративна модель (Iterative Model)
    # 3. Гнучка розробка (Agile Development)
    # 4. DevOps
# Вибір методології залежить від специфіки проекту, вимог замовника та команди розробників.
"""
#=====================================================================================================
"""
    ! UML (Unified Modeling Language — уніфікована мова моделювання) !
Це мова графічного опису для об'єктного моделювання в галузі розробки програмного забезпечення, для моделювання бізнес-процесів, системного проектування та відображення організаційних структур.
UML є мовою широкого профілю, це відкритий стандарт, що використовує графічні позначення для створення абстрактної моделі системи, яка називається UML-моделлю. 
UML була створена для визначення, візуалізації, проектування та документування, переважно, програмних систем. 
UML не є мовою програмування, але на основі UML-моделей можлива генерація коду.
"""
#=====================================================================================================
