"""
    ! Асинхронний код !
Це код, що виконує паралельно кілька завдань.
Найпростіший спосіб реалізувати асинхронність — це виконувати завдання в окремих потоках всередині одного процесу.
"""
#==============================================================================================
"""
*Потік — послідовність інструкцій та системних викликів всередині процесу.
*Процес — область пам'яті (віртуальна) + набір ресурсів + 1 і більше потоків.

Всі потоки мають доступ до всіх ресурсів свого процесу. 
Усі процеси ізольовані один від одного, і будь-яка міжпроцесна взаємодія відбувається тільки через операції введення/виведення (системні виклики).
"""
#==============================================================================================
"""
    ! IO (Input Output)-bound завдання !
Це завдання, які виконують операції введення/виведення (читання/запис файлів, запити в мережі)
"""
#==============================================================================================
"""
Загальне правило для програмування будь-якою мовою: якщо є можливість обійтися синхронним кодом, то так і потрібно зробити.
"""
#==============================================================================================
"""
    ! CPU-bound завдання !
Це завдання, які виконують математичні операції.
"""
#==============================================================================================
