"""
    ! ООП ! (Об'єктно Орієнтоване Програмування)
Це програмування, засноване на взаємодії об'єктів.
☝ Спосіб організації програм, коли об'єднують дані та функціонал усередині якогось об'єкта, називають об'єктноорієнтованою парадигмою програмування.
"""
#================================================================================================
"""
    ! Клас !
Це шаблон, з якого створюються об'єкти (у контексті ООП).
Клас це шаблон, а об'єкт це екземпляр класу.
"""
#================================================================================================
class User:
    name = 'Anonymous'
    age = 15

user1 = User()
print(user1.name)
print(user1.age)

user2 = User()
user2.name = "John"
user2.age = 90

print(user2.name)
print(user2.age)

#================================================================================================
"""
Метод __init__ використовується як конструктор для ініціалізації нових об'єктів класу.
        self використовується для доступу до атрибутів і методів конкретного екземпляра класу.
        Методи можуть звертатися до атрибутів екземпляра через self.
"""
#================================================================================================
class MyClass:
    def __init__(self, value):
        self.instance_field = value  # Поле класу

obj1 = MyClass(5)
obj2 = MyClass(10)

print(obj1.instance_field)  # Виведе: 5
print(obj2.instance_field)  # Виведе: 10
#================================================================================================
"""
    ! Метод класу !
Це функція, яка оперує з полями класу та/або аргументами, які передаються у метод.
"""
#================================================================================================
class Person:
    def __init__(self, name: str, age: int):
        self.name = name
        self.age = age

    def say_name(self) -> None:
        print(f'Hi! I am {self.name} and I am {self.age} years old.')

    def set_age(self, age: int) -> None:
        self.age = age

bob = Person('Boris', 34)

bob.say_name()
bob.set_age(25)
bob.say_name()

#================================================================================================
"""
    ! Атрибут класу !
Це змінна, яка визначена на рівні класу, а не екземпляра класу. 
Це означає, що вона спільна для всіх екземплярів цього класу. 
Атрибути класу використовуються для зберігання даних, які повинні бути однаковими для всіх об'єктів класу.

    ! Змінна класу або атрибут класу !
Це змінна, яка зберігається в класі та доступ до них мають усі екземпляри цього класу. 
Змінна класу існує тільки одна, та будь-який з об'єктів, коли змінює змінну класу, змінює її для решти екземплярів цього ж класу.
"""
class MyClass:
    class_attribute = "I am a class attribute" 

#================================================================================================
"""
    ! Поле класу ("атрибут екземпляра") !
Це змінна, яка визначена на рівні окремого екземпляра класу. 
Кожен екземпляр класу має свій власний набір полів, які можуть приймати різні значення для різних екземплярів. Полем може бути будь-який об'єкт Python. 
Зазвичай це змінна, або контейнер (словник, список, рядок тощо). 
Поля класу використовуються для зберігання даних, що специфічні для кожного окремого об'єкта.

    ! Змінна об'єкту або поле класу ! 
Це змінна, яка зберігається в об'єкті. 
Вона належать кожному окремому екземпляру класу. 
У цьому випадку кожен об'єкт має свою власну копію поля, тобто вона жодним чином не пов'язана з іншими такими ж полями в інших екземплярах.
"""
#================================================================================================
"""
Атрибути класу спільні для всіх екземплярів, а поля унікальні для кожного екземпляра.
"""
#================================================================================================
class Person:
    count = 0   # атрибут класу/змінна класу - тут count належить класу Person
                # Його значення завжди одне й те саме для любого об'єкту класу.
    def __init__(self, name: str):
        self.name = name    # поле класу/змінна об'єкту - тут змінна name належить об'єкту 
                            # Його значення для кожного об'єкту своє. 
        Person.count += 1

    def how_many_persons(self):
        print(f"Кількість людей зараз {Person.count}")

first = Person('Boris')
first.how_many_persons()
second = Person('Alex')
first.how_many_persons()

#================================================================================================
class Person:
    count = 0

    def __init__(self):
        pass

person = Person()
print(person.count)  # 0

#================================================================================================
class Person:
    count = 0

    def __init__(self):
        self.count = 10

person = Person()
print(person.count)  # 10

#================================================================================================
class Person:
    count = 0

    def __init__(self):
        self.count = 10

person = Person()
print(person.count)  # 10
print(Person.count)  # 0
"""
Тут person.count повертає 10 - значення поля об'єкту person, 
а Person.count повертає атрибут класу зі значенням 0.
"""
#================================================================================================
class Pokemon:
    def __init__(self, name, type, health):
        self.name = name        # атрибути класу
        self.type = type        # атрибути класу
        self.health = health    # атрибути класу

    def attack(self, other_pokemon):    # метод класу
        print(f"{self.name} attacks {other_pokemon.name}!")

    def dodge(self):                    # метод класу
        print(f"{self.name} dodged the attack!")

    def evolve(self, new_form):         # метод класу
        print(f"{self.name} is evolving into {new_form}!")
        self.name = new_form

# Створення об'єкта Pikachu / об'єкт класу Pokemon - pikachu
pikachu = Pokemon("Pikachu", "Electric", 100)

# Використання методів
pikachu.attack(Pokemon("Charmander", "Fire", 100))
pikachu.dodge()
pikachu.evolve("Raichu")
"""
Pikachu attacks Charmander!
Pikachu dodged the attack!
Pikachu is evolving into Raichu!
"""
#================================================================================================
def __init__(self, name, type, health):
        self.name = name  # Ініціалізація атрибута імені
        self.type = type  # Ініціалізація атрибута типу
        self.health = health  # Ініціалізація атрибута здоров'я
#================================================================================================

