"""
    ! Багаторівневе наслідування !
Це коли клас наслідує від іншого класу, який вже є похідним класом. Це створює "ланцюжок" наслідування, де можливості передаються через декілька рівнів.
"""
#================================================================================================
class Animal:
    def __init__(self, nickname: str, age: int):
        self.nickname = nickname
        self.age = age

    def make_sound(self):
        pass

class Bird(Animal):
    def make_sound(self):
        return "Chirp"

class Parrot(Bird):
    def can_fly(self):
        return True

class TalkingParrot(Parrot):
    def say_phrase(self, phrase):
        return f"The parrot says: '{phrase}'"

my_parrot = TalkingParrot("Alice", 2)
print(my_parrot.make_sound())   # Chirp
print(my_parrot.can_fly())      # True
print(my_parrot.say_phrase("Hello, World!")) # The parrot says: 'Hello, World!'

#================================================================================================
"""
    ! MRO (Method Resolution Order) !
Це послідовність класів, в якій Python, визначає порядок, за яким класи будуть переглядатися під час пошуку методів.
"""
#================================================================================================
"""
    MRO у Python працює наступним чином:

1. Шукає атрибут серед атрибутів самого класу. Саме завдяки цьому ви можете "перевизначати" батьківські атрибути.
2. Шукає атрибут у першого з батьків (той, що вказаний першим у списку батьків).
3. Шукає атрибут у наступного батька у списку батьків, доки такі є.
4. Шукає атрибут у батьках першого батька.
5. Повторює пункт 4 для всіх батьків.
6. Викликає виняток, що атрибут не знайдено.
"""
#================================================================================================
class A:
    pass

class B(A):
    pass

class C(A):
    pass

class D(B, C):
    pass

print(D.mro())  # Виведе порядок розв'язання методів для класу D
# [<class '__main__.D'>, <class '__main__.B'>, <class '__main__.C'>, <class '__main__.A'>, <class 'object'>]

#================================================================================================
class A:
    name = "Я клас A"

class B:
    name = "Я клас B"
    property = "Я знаходжусь в класі B"

class C(A, B):
    property = "Я знаходжусь в класі C"

c = C()
print(c.name)       # Я клас A
print(c.property)   # Я знаходжусь в класі C

#================================================================================================
class A:
    name = "Я клас A"

class B:
    name = "Я клас B"
    property = "Я знаходжусь в класі B"

class C(B, A):
    property = "Я знаходжусь в класі C"

c = C()
print(c.name)       # Я клас B
print(c.property)   # Я знаходжусь в класі C
