"""
        ! API !

Application programming interface — опис способів (набір класів, процедур, функцій, структур або констант),
якими одна комп'ютерна програма може взаємодіяти з іншою програмою.
"""
#=======================================================================================================================
"""
    ! FastAPI !

FastAPI - це веб-фреймворк для створення API на Python,
    який дозволяє розробникам швидко і легко створювати високопродуктивні веб-додатки.
FastAPI використовує сучасні можливості Python.
Він підтримує асинхронне програмування, що дозволяє обробляти велику кількість запитів одночасно,


FastAPI- це сучасний, швидкий (high-performance) веб-фреймворк для побудови REST API на Python,
створений на основі стандарту Python 3.7+ typing.
Він дозволяє розробникам швидко створювати API з мінімальними зусиллями,
забезпечуючи при цьому високу продуктивність і простоту використання.
"""
#=======================================================================================================================
"""
Основні особливості FastAPI:
1. Висока продуктивність:
    FastAPI використовує асинхронні можливості Python, що дозволяє обробляти велику кількість запитів одночасно.
2. Простота використання:
    FastAPI має простий і інтуїтивно зрозумілий синтаксис, що дозволяє розробникам швидко створювати API.
3. Автоматична документація:
    FastAPI автоматично генерує документацію для вашого API,
    використовуючи OpenAPI та JSON Schema, що полегшує тестування та інтеграцію з іншими сервісами.
4. Валідація даних:
    FastAPI використовує Pydantic для валідації даних,
    що дозволяє легко визначати структуру даних і забезпечувати їх правильність.
5. Підтримка типів:
    FastAPI підтримує типи даних Python,
    що дозволяє розробникам використовувати статичну типізацію для покращення якості коду та зменшення кількості помилок.
6. Легка інтеграція:
    FastAPI легко інтегрується з іншими бібліотеками та фреймворками,
    такими як SQLAlchemy, OAuth2, JWT та іншими, що дозволяє розробникам створювати складні та потужні API.
7. Підтримка стандартних бібліотек:
    FastAPI використовує стандартні бібліотеки Python, такі як Pydantic для моделювання даних
    і Starlette для обробки запитів та відповідей, що дозволяє легко інтегрувати його з іншими бібліотеками.
FastAPI є відмінним вибором для розробки REST API,
особливо коли потрібна висока продуктивність і простота використання.
Він підходить для створення як невеликих, так і великих проектів,
і має активну спільноту розробників, що підтримують його розвиток.
"""
#=======================================================================================================================
"""
При побудові API, зазвичай, використовуються конкретні методи HTTP для виконання певної дії.

POST: для створення даних.
GET: для читання даних.
PUT: для оновлення даних.
PATCH: для часткового оновлення даних.
DELETE: для видалення даних
"""
#=======================================================================================================================
