"""
        ! API !

Application programming interface — опис способів (набір класів, процедур, функцій, структур або констант),
якими одна комп'ютерна програма може взаємодіяти з іншою програмою.
"""

# =======================================================================================================================
"""
        ! REST API !

Це архітектурний стиль для створення веб-сервісів,
який використовує HTTP-протокол для обміну даними між клієнтом і сервером.

REST API базується на принципах REST (Representational State Transfer),
які визначають, як ресурси (дані) повинні бути представлені
і як клієнт може взаємодіяти з ними через HTTP-методи (GET, POST, PUT, DELETE).

REST API дозволяє створювати гнучкі, масштабовані і легко підтримувані веб-сервіси,
які можуть бути використані різними клієнтами, такими як веб-браузери, мобільні додатки або інші сервери.
"""
# =======================================================================================================================
"""
REST (REpresentational State Transfer) розшифровується як передача репрезентативного стану.
Це набір принципів проектування для підвищення масштабованості і гнучкості мережевих комунікацій.
"""
# =======================================================================================================================
"""
URI - це ідентифікатор конкретного ресурсу. Як сторінка, книга або документ.

URL - Це особливий тип ідентифікатора, який також говорить вам, як отримати доступ до нього.

Існує наступна традиційна форма запису `URL:
<scheme>://[<login>[:<password>]@]<host>[:<port>]][/<path>][?<query>][#<fragment>]

Приклад:
https://user:password@host.com:80/resourse/path/?query=name&ttt=123#hash

У цьому записі:
- scheme — Це мережевий протокол, за яким відбувається звернення до ресурсу
- login — не обов'язковий параметр, ім'я користувача, яке використовується для доступу до ресурсу
- password — пароль вказаного користувача, якщо він необхідний
- host — повністю прописане доменне ім'я хоста в системі
    DNS (goit.ua) або IP-адреса хоста у формі чотирьох груп десяткових чисел, розділених крапками
- port — порт хоста для підключення.
    Згадайте, ми використовували http://localhost:3000, де 3000 — це і є порт.
    Виникає закономірне питання: чому порт не вказується, наприклад, для URL у браузері.
    Просто браузер знає, що для протоколу http порт дорівнює 80,
    а для https він дорівнює 443 і підставляє його за нас
- path — уточнююча інформація про місце знаходження ресурсу.
- query — рядок запиту з параметрами, що передаються на сервер (методом GET).
    Починається із символу ?, роздільник параметрів — знак &. Приклад: ?foo=123&baz=234&bar=value
- fragment — ідентифікатор із попереднім символом #.
    Часто його називають хеш — hash або якір.
    Якорем може бути вказаний заголовок всередині документа або атрибут id елемента.
    За таким посиланням браузер відкриє сторінку та перемістить вікно перегляду до зазначеного елемента.
    Наприклад, посилання на секцію контактів у лендінгу: https://example.com/#contact.
"""
# =======================================================================================================================
"""
Архітектурні обмеження RESTful

RESTful архітектура має шість основних обмежень, які визначають її структуру і поведінку:
1. Клієнт-серверна архітектура:
2. Безстанова (Stateless):
3. Єдиний інтерфейс (Uniform Interface):
4. Кешування (Cacheable):
5. Багатошаровість (Layered System):
6. Код на вимогу (Code on Demand):
"""
# =======================================================================================================================
"""
    Клієнт-сервер
Перше обмеження вказує, що мережа повинна складатися з клієнтів і серверів.
Сервер — це комп'ютер, у якого є ресурси, що цікавлять,
а клієнт — це комп'ютер, який хоче взаємодіяти з ресурсами, що зберігаються на сервері.

    Stateless
Відсутність стану. Відсутність стану не означає, що сервери та клієнти не мають стану,
це просто означає, що їм не потрібно відслідковувати стан один одного.

    Єдиний інтерфейс
Це обмеження гарантує, що існує спільна мова між серверами та клієнтами,
яка дозволяє замінювати або змінювати кожну частину без порушення роботи всієї системи.
Це досягається за рахунок 4 додаткових обмежень:
-ідентифікація ресурсів
-маніпулювання ресурсами за допомогою представлень
-інформативні (самоописові) повідомлення
-гіпермедіа.

    Кешування
Кешування належить до обмеження,
за якого відповіді сервера повинні бути позначені як кешовані або некешовані.

    Багатошарова (багаторівнева) система
Багатошарова (багаторівнева) система полягає в тому,
що компонентів може бути більше, ніж просто серверів та клієнтів.
Це означає, що у системі може бути більше одного рівня.

    Код за запитом
Необов'язкове обмеження, яке належить до можливості сервера відправляти виконуваний код клієнту.
"""
# =======================================================================================================================
"""
    Основні методи HTTP

    Ідемпотентність
Властивість об'єкта або операції при повторному застосуванні операції до об'єкта
давати той самий результат, як і за першого.
    Безпечність
Операція, яка не змінює стан ресурсу, вважається безпечною.
Безпечні операції можуть бути ідемпотентними,
але не всі ідемпотентні операції є безпечними.
    Ідемпотентність і безпечність
Безпечні операції завжди ідемпотентні, оскільки вони не змінюють стан ресурсу.
Ідемпотентні операції можуть бути безпечними або небезпечними, залежно від того, чи змінюють вони стан ресурсу.

При побудові API, зазвичай, використовуються конкретні методи HTTP для виконання певної дії.
POST: для створення даних.
GET: для читання даних.
PUT: для оновлення даних.
PATCH: для часткового оновлення даних.
DELETE: для видалення даних.
"""
# =======================================================================================================================
"""
    HTTP метод GET
Використовується для отримання (або читання) представлення ресурсу.
У разі успішної адреси, метод GET повертає представлення ресурсу
у форматі XML або JSON в поєднанні з кодом стану HTTP 200 (OK).
У разі невдачі повертається код 404 (NOT FOUND) або 400 (BAD REQUEST).

    HTTP метод POST
Запит найчастіше використовується для створення нових ресурсів.
На практиці він також використовується для створення вкладених ресурсів.
При створенні нового ресурсу POST запит надсилає представлення,
а сервіс бере на себе відповідальність за призначення новому ресурсу ID тощо.
У разі успішного створення ресурсу повертається HTTP код 201 Create,
а також може бути встановлений заголовок Location з адресою створеного ресурсу.

    HTTP метод PUT (PATCH)
Зазвичай використовується для оновлення ресурсу.
Тіло запиту при відправленні PUT-запиту до існуючого ресурсу URL
повинна містити оновлені дані оригінального ресурсу
(повністю, або тільки частину, що оновлюється, — PATCH).
У разі успішного оновлення повертається код 200
(або 204, якщо не було передано будь-який контент у тілі відповіді).

    HTTP метод DELETE
Використовується для видалення ресурсу, ідентифікованого конкретним URL (ID).
У разі успішного видалення ресурсу повертається
код 200 (OK) HTTP спільно з тілом відповіді, що містить дані видаленого ресурсу.
Також можливе використання HTTP коду 204 (NO CONTENT) без тіла відповіді.
"""
# =======================================================================================================================
"""
    Коди відповіді HTTP
Коди поділяються на п'ять груп:

1. Інформаційні 100 - 199
  100: Continue

2.Успішні 200 - 299
  200: OK
  201: Created
  202: Accepted
  204: No Content

3.Перенаправлення 300 - 399
  301: Moved Permanently
  307: Temporary Redirect

4.Клієнтські помилки 400 - 499
  400: Bad Request
  401: Unauthorized
  403: Forbidden
  404: Not Found

5.Серверні помилки 500 - 599
  500: Internal Server Error
  501: Not Implemented
  502: Bad Gateway
  503: Service Unavailable
  504: Gateway Timeout
"""
# =======================================================================================================================
"""
Формування URL для REST API

При формуванні URL для REST API важливо дотримуватися певних правил і рекомендацій,
щоб забезпечити зрозумілість, логічність і зручність використання API.
Ось деякі основні принципи формування URL для REST API:
1. Використовуйте іменники для ресурсів:
   URL повинні містити іменники, які описують ресурси, до яких вони відносяться.
   Наприклад, /users для колекції користувачів або /products для колекції продуктів.
2. Використовуйте множину для колекцій:
   Якщо URL представляє колекцію ресурсів, використовуйте множину для імені ресурсу.
   Наприклад, /users для колекції користувачів, а не /user.
3. Використовуйте ієрархію для відображення відносин між ресурсами:
   Якщо ресурси мають ієрархічні відносини, використовуйте ієрархію в URL для відображення цих відносин.
   Наприклад, /users/{userId}/orders для замовлень конкретного користувача.
4. Використовуйте параметри запиту для фільтрації, сортування і пагінації:
   Для фільтрації, сортування і пагінації ресурсів використовуйте параметри запиту в URL.
   Наприклад, /products?category=electronics для фільтрації продуктів за категорією або /users?sort=asc для сортування користувачів за зростанням.
5. Уникайте використання дієслів у URL:
   URL повинні містити іменники, а не дієслова. Це допомагає зробити URL більш зрозумілими і логічними.
    Наприклад, використовуйте /users для колекції користувачів, а не /getUsers або /createUser.
6. Використовуйте нижнє підкреслення або дефіс для розділення слів:
   Для покращення читабельності URL використовуйте нижнє підкреслення (_) або дефіс (-) для розділення слів.
   Наприклад, /user_profiles або /user-profiles для колекції профілів користувачів.
7. Використовуйте версіонування API:
    Якщо ви плануєте вносити зміни в API, які можуть порушити сумісність з попередніми версіями,
    використовуйте версіонування в URL.
    Наприклад, /v1/users для першої версії API і /v2/users для другої версії API.
Дотримання цих принципів допоможе створити зрозумілий, логічний і зручний для використання REST API, який буде легко підтримувати і розширювати в майбутньому.
"""
# =======================================================================================================================
"""
Часто кінцеві URL за запитом ресурсу називають endpoints API.
Endpoint — це конкретна URL-адреса, яка відповідає певному ресурсу або дії в API.
Наприклад, якщо у вас є API для управління користувачами, то кінцеві URL можуть бути такими:
- GET /users — отримати список всіх користувачів
- POST /users — створити нового користувача
- GET /users/{id} — отримати інформацію про конкретного користувача за його ID
- PUT /users/{id} — оновити інформацію про конкретного користувача за його ID
- DELETE /users/{id} — видалити користувача за його ID
Endpoints API є важливою частиною дизайну API, оскільки вони визначають,
як клієнти можуть взаємодіяти з ресурсами і виконувати різні дії в системі.
"""
# =======================================================================================================================
"""
Пагінація здійснюється через query рядок за допомогою параметра offset —
це початковий номер позиції і параметра limit — максимальна кількість елементів, що повертаються.
Вони можуть називатися і по-іншому, наприклад skip, limit.address, page, size і т.д.
Наприклад, якщо у вас є API для отримання списку користувачів, то ви можете використовувати пагінацію,
щоб обмежити кількість користувачів, які повертаються в одному запиті.
Наприклад, якщо ви хочете отримати перші 10 користувачів,ви можете зробити запит GET /users?offset=0&limit=10.
Якщо ви хочете отримати наступні 10 користувачів, ви можете зробити запит GET /users?offset=10&limit=10, і так далі.
Пагінація допомагає зменшити навантаження на сервер і покращити продуктивність,
особливо коли у вас є велика кількість даних, які потрібно повернути клієнту.
"""
# =======================================================================================================================
"""
Складна фільтрація за значеннями.
Можна використовувати роздільник — подвійна двокрапка ::,
яка відокремлює ім'я властивості від значення порівняння.
Наприклад, якщо ви хочете отримати всіх користувачів, які старші за 18 років,
ви можете зробити запит GET /users?age::gt=18.
У цьому прикладі age — це ім'я властивості, gt — це оператор порівняння (greater than),
а 18 — це значення, з яким порівнюється властивість.
Існують різні оператори порівняння, які можна використовувати для складної фільтрації,
такі як eq (equal), ne (not equal), lt (less than), lte (less than or equal),
gt (greater than), gte (greater than or equal) і т.д.
Цей підхід дозволяє створювати більш гнучкі і потужні API,
які можуть обробляти складні запити і фільтрацію даних на сервері,
що зменшує навантаження на клієнта і покращує продуктивність.
"""
# =======================================================================================================================
"""
Сортування. Один із способів, коли для кожної властивості, що передається,
здійснюється сортування в порядку зростання, а для кожної властивості з префіксним тире ("-") -
сортування здійснюється в порядку спадання.
Сепаратор для кожного імені властивості — вертикальна смуга ("|").
Наприклад, якщо ви хочете отримати список користувачів, відсортованих за віком у порядку зростання,
а потім за ім'ям у порядку спадання, ви можете зробити запит GET /users?sort=age|-name.
У цьому прикладі age — це ім'я властивості, за якою відбувається сортування в порядку зростання,
а -name — це ім'я властивості, за якою відбувається сортування в порядку спадання.
Цей підхід дозволяє створювати більш гнучкі і потужні API,
які можуть обробляти складні запити і сортування даних на сервері,
що зменшує навантаження на клієнта і покращує продуктивність
"""
# =======================================================================================================================
