"""
    ! Docker !
Це платформа, яка дозволяє «створювати, постачати та запускати будь-який застосунок всюди». 
Docker використовує технологію контейнеризації, яка дозволяє розробникам пакувати застосунок з усіма його залежностями в один контейнер. 
Це забезпечує узгодженість середовища виконання, незалежно від того, де запускається контейнер. 
Docker дозволяє розробникам створювати, тестувати та розгортати застосунки швидко та ефективно, що робить його популярним інструментом у світі розробки програмного забезпечення та DevOps.
"""
#====================================================================================================
"""
Платформа Docker складається із двох окремих компонентів: 
- Docker Engine: механізму, що відповідає за створення та функціонування контейнерів, 
- Docker Registry: сервіс Hub — хмарного сервісу для розповсюдження контейнерів (такий собі аналог GitHub).
"""
#==================================================================================================== 

"""
Етапи створення Docker образу:
1. Створи директорію, в якій створи python файл app.py, який ви хочете запустити в контейнері. 
2. Пропиши у файлі app.py код:

"""
from flask import Flask
app = Flask(__name__)
@app.route('/')
def hello_world():
    return 'Hello, World!'
if __name__ == '__main__':
    app.run(debug=True, host='127.0.0.1', port=5000)
"""

3. Створи Dockerfile: Це текстовий файл, який містить інструкції для створення образу. Він визначає базовий образ, встановлює залежності, копіює файли та вказує команду для запуску застосунку.
Також створи файл (.dockerignore) щоб не копіювати сміття в контейнер
"""
FROM python:latest
#MAINTAINER Hrigoriu Programmer "Hrigoriu@gmail.com" 
#стара форма, яка вже не підтримується, тому використовуємо LABEL
LABEL maintainer="Hrigoriu Programmer" email="Hrigoriu@gmail.com"
COPY . /app
WORKDIR /app
RUN pip install flask
ENTRYPOINT [ "python" ]
CMD [ "app.py" ]
"""
4. Створимо файл requirements.txt, який містить всі залежності вашого застосунку. 
У цьому випадку, оскільки ми використовуємо Flask, файл requirements.txt буде містити рядок "flask".

5. Зберемо образ: Використовуючи команду "docker build", збираєте образ на основі Dockerfile. 
Це створює новий образ, який містить ваш застосунок та всі його залежності.
Команда: docker build -t my_flask_app .

6. Запустимо контейнер: Після того як образ створено, ви можете запустити контейнер за допомогою команди "docker run". 
Команда: docker run -p 5000:5000 my_flask_app 
Це створює ізольоване середовище, де ваш застосунок може працювати незалежно від інших процесів на вашій машині. 
Контейнер використовує образ як шаблон для свого середовища виконання.

7. Створимо файл docker-compose.yml, який описує, як запустити ваш застосунок та його залежності (наприклад, базу даних).

"""
version: '3'

services:
  database:
    image: mysql:latest
    environment:
      MYSQL_USER: user
      MYSQL_PASSWORD: password
      MYSQL_DATABASE: my_sql_database
    ports:
      - "3306:3306"
"""


!!! Після кожного внесення зміни
docker build -t my_flask_app .

потім лише 
docker run -p 5000:5000 my_flask_app 
!!!

8. Пропишемо команду: 
docker-compose build
docker-compose up (запускає всі сервіси)

"""
#====================================================================================================
"""
docker pull image:tag
docker pull MySQL
docker run [options] image: tag [command, args]
docker ps [options]
docker build [OPTIONS] PATH | URL | -
"""
#====================================================================================================
"""
Щоб все працювало: запусти Docker Desktop, потім у терміналі виконай команду:

poetry add fastapi
docker pull redis
docker images  (покаже, які пакети установлені)


poetry add unicorn[standart]
python main.py
docker build -t fast_goit . (. показує, що Dockerfile знаходиться в поточній папці)

# 1. Збірка образу
docker build -t fast_goit .

# 2. Запуск контейнера
docker run -p 8000:8000 fast_goit

"""
#====================================================================================================
#main.py
from fastapi import FastAPI
app = FastAPI()
@app.get("/")
def read_root():
    return {"Hello": "World"}
@app.get("/items/{item_id}")
def read_item(item_id: int, q: str | None = None):
    return {"item_id": item_id, "q": q}
if __name__ == "__main__":
    import uvicorn

    uvicorn.run(app, host="0.0.0.0", port=8000)
    #uvicorn.run(app, host="localhost", port=8000)
#====================================================================================================
"""
uvicorn.run(app, host="localhost", port=8000) написав і все відкривається
uvicorn.run(app, host="0.0.0.0", port=8000) і нічого не відкривається, хоча сервер працює і в консолі видно, що він слухає
Це класична помилка Windows.
Адреса 0.0.0.0 означає для сервера "слухати всіх", але для браузера на Windows це "нікуди". Браузер не знає, як постукати у двері з написом 0.0.0.0.
Тобі потрібно замінити 0.0.0.0 на localhost (або 127.0.0.1 — це "домашня адреса" твого комп'ютера).
Введи в браузері: 👉 http://localhost:5000
(Або http://127.0.0.1:8000)
(Або http://192.168.56.1:8000), можна знайти свою IP адресу (в терміналі ввести команду ipconfig і знайти IPv4-адресу)
Спробуй і напиши, чи з'явився "Hello World".
"""
#====================================================================================================
"""
Після того як створили файл docker-compose.yaml, потрібно виконати команду:
docker-compose up --build
"""
