"""
    ! Автоматичне форматування коду !
Чорний колір - це чорний пояс у бойових мистецтвах, який символізує майстерність і високий рівень знань. 
У програмуванні "чорний код" або "чорний стиль" часто використовується для опису коду, який є чистим, зрозумілим і добре структурованим. 
Це може означати, що код написаний з дотриманням кращих практик, має хорошу читабельність і легко підтримується.

black суворо дотримується PEP8 - офіційного стилю кодування для Python, який визначає правила форматування коду, такі як відступи, довжина рядків, використання пробілів і так далі.
Black автоматично форматуватиме ваш код відповідно до цих правил, що допоможе зробити ваш код більш читабельним і підтримуваним.
"""
#====================================================================================================
"""
Щоб встановити black, достатньо виконати pip install black. 

Коли вам потрібно відформатувати якийсь файл або цілий пакет, ви можете виконати в консолі 
команду: black my_python_script.py або black my_package
"""
#====================================================================================================
"""
pip install isort
буде встановлено інструмент isort, який допомагає автоматично сортувати імпорти у вашому коді.
Щоб відформатувати імпорти у файлі, ви можете виконати команду: isort my_python_script.py
"""