"""
    ! debugger !
Термін відлагодження насамперед означає усунення помилок у коді. Але він також може означати процес пошуку та усунення помилок у коді, а також процес оптимізації коду для покращення його продуктивності.
"""
#====================================================================================================
"""
Точки зупинки можна задавати у самому модулі. Запускати дебагер можна з консолі:
python3 -m pdb myscript.py

Або з інтерпретатора Python:
import pdb
import mymodule
pdb.run('mymodule.test()')
"""
#====================================================================================================
"""
https://code.visualstudio.com/docs/python/debugging
https://www.jetbrains.com/help/pycharm/debugging-your-first-python-application.html
https://www.jetbrains.com/help/pycharm/part-1-debugging-python-code.html
"""
#====================================================================================================