"""
Щоб установити .exe файл, потрібно виконати наступні кроки: 
1. в командній строці ввести команду: pip install pyinstaller
2. перейти в папку з вашим .py файлом, який ви хочете перетворити в .exe
3. в командній строці ввести команду: pyinstaller --onefile your_script.py 
(наприклад, pyinstaller test.py)
4. після виконання команди, у папці dist з'явиться ваш .exe файл, який можна запускати на будь-якому комп'ютері без необхідності встановлювати Python.
"""

print("Hello world")
#=========================================================================================

