"""
        ! Ітератор !
* Це об'єкт, який дозволяє нам послідовно перебирати елементи будь-якого об'єкта ітерації (наприклад, списку, кортежу, словника) без потреби використання індексів. 
Ітератори дозволяють послідовно перебирати елементи об'єкта ітерації, не завантажуючи всю послідовність у пам'ять, і неможливо повторно перебрати елементи з одного і того ж ітератора.

Він реалізує методи __iter__() та __next__() та дозволяє перебирати елементи послідовності, не завантажуючи всю послідовність у пам'ять.
* Це об'єкт, який дозволяє користувачу перебирати всі елементи контейнера без потреби знати внутрішню структуру контейнера. 

Щоб створити ітератор, потрібно визначити клас з цими двома методами.
Реалізується за допомогою методів __iter__() та __next__(). 
* Метод __iter__() повертає об'єкт ітератора, а метод __next__() автоматично викликається циклом for або функцією next() для отримання наступного елемента контейнера. 
* Метод __iter__() повертає сам ітератор, а метод __next__() повертає наступний елемент об'єкта ітерації. 
Коли елементи ітератора закінчуються, має бути викинуто виняток StopIteration, що сигналізує про завершення ітерації.
"""
#==============================================================================================
class CountDown:
    def __init__(self, start):
        self.current = start

    def __iter__(self):
        return self

    def __next__(self):
        if self.current == 0:
            raise StopIteration
        self.current -= 1
        return self.current

if __name__ == '__main__':
    counter = CountDown(5)
    for count in counter:
        print(count)
"""
5
4
3
2
1
0
"""
#==============================================================================================
"""
        ! Генератор !
* Це спрощений спосіб створення ітераторів. 
Функція стає генератором, коли містить вираз yield. 
Генератор автоматично реалізує методи __iter__() та __next__().
* Генератори в Python є спрощеним способом створення ітераторів. 
Вони автоматично реалізують методи __iter__() та __next__() за допомогою ключового слова yield.

* Це функція, яка дозволяє декларативно створювати ітератор за допомогою ключового слова yield. 
Він автоматично реалізує методи __iter__() та __next__(), тому більше не потрібно їх явно визначати. Створення генератора - це просто написання функції, яка використовує yield для повернення наступного значення.
"""
#==============================================================================================
def count_down(start):
    current = start
    current -= 1
    while current >= 0:
        yield current
        current -= 1

# Використання генератора
for count in count_down(5):
    print(count)
"""
5
4
3
2
1
0
"""
#==============================================================================================
from random import randint

class RandIterator:
    def __init__(self, start, end, quantity):
        self.start = start
        self.end = end
        self.quantity = quantity
        self.count = 0

    def __iter__(self):
        return self

    def __next__(self):
        self.count += 1
        if self.count > self.quantity:
            raise StopIteration
        else:
            return randint(self.start, self.end)

if __name__ == '__main__':
    my_random_list = RandIterator(1, 20, 5)

    for rn in my_random_list:
        print(rn, end=' ')
""" 
14 3 19 7 11 
"""
#==============================================================================================
from random import randint

def rand_generator(start, end, quantity):
    count = 0
    while count < quantity:
        yield randint(start, end)
        count += 1

if __name__ == '__main__':
    for rn in rand_generator(1, 20, 5):
        print(rn, end=' ')
"""
14 3 19 7 11 
"""
#==============================================================================================
