#==============================================================================================
""" 
    ! метод __str__ !
* Це метод, який визначає "неформальне" або "красиве" представлення об'єкта. 
Він використовується, коли ми хочемо вивести об'єкт у зручному для читання форматі, наприклад, за допомогою функції print() або str().

* Цей метод призначений для повернення рядкового представлення об'єкта, яке має бути читабельним і зрозумілим для людини. 

Коли ви викликаєте функцію str() для об'єкта або друкуєте об'єкт за допомогою print(), Python автоматично використовує метод __str__ вашого класу. 
Це дає вам, як розробнику, можливість визначити, як об'єкт має бути представлений у зрозумілій формі.
"""
#==============================================================================================
class Human:
    def __init__(self, name: str, age: int):
        self.name = name
        self.age = age

    def __str__(self):
        return f"Human named {self.name} who is {self.age} years old"
    
    def __repr__(self):
        return f"Human({self.name}, {self.age})"

human = Human("Alice", 30)
print(human) # Human named Alice who is 30 years old
#==============================================================================================
"""
Наш метод __str__ призначений для повернення рядка, який є зрозумілим для кінцевого користувача. 
Якщо цей метод не визначено, Python використає метод __repr__ як запасний варіант для перетворення об'єкта в рядок.
"""
#==============================================================================================
class Human:
    def __init__(self, name: str, age: int):
        self.name = name
        self.age = age

    #def __str__(self):
        #return f"Human named {self.name} who is {self.age} years old"
    
    def __repr__(self):
        return f"Human({self.name}, {self.age})"

human = Human("Alice", 30)
print(human) # Human(Alice, 30)
#==============================================================================================
