"""
    ! Статичні методи ! декоратор @staticmethod !
* Ці методи, не мають доступу до екземпляру класу тобто змінної self, з якого вони були викликані. 
Це означає, що статичні методи не можуть змінювати стан об'єкта або класу, але вони можуть бути корисними для виконання деяких операцій, які не залежать від стану об'єкта. 
* Статичні методи можна розглядати як "допоміжні" функції, які мають логічний зв'язок із класом, але не потребують доступу до його атрибутів або методів.
"""
#==============================================================================================
class Geometry:
    PI = 3.14159

    @staticmethod
    def area_of_circle(radius):
        return Geometry.PI * radius ** 2

if __name__ == "__main__":
    print(Geometry.area_of_circle(5))   # Виклик статичного методу без створення екземпляру класу
# 78.53975
#==============================================================================================
"""
    ! Класові методи ! декоратор @classmethod !
* Ці методи на відміну від статичних методів, мають доступ до самого класу через параметр cls, який автоматично передається Python. 
Це означає, що класові методи можуть змінювати стан класу або викликати інші класові методи. 
* Класові методи часто використовуються для фабричних методів, які створюють екземпляри класу, використовуючи різні способи ініціалізації, ніж стандартний конструктор.
"""
#==============================================================================================
class Employee:
    def __init__(self, name, position):
        self.name = name
        self.position = position

    @classmethod
    def from_string(cls, employee_info):
        name, position = employee_info.split(',')
        return cls(name, position)
if __name__ == "__main__":
    emp_str = "John Doe,Software Engineer"
    emp = Employee.from_string(emp_str)  # Виклик класового методу для створення екземпляру
    print(emp.name)      # John Doe
    print(emp.position)  # Software Engineer

    employee_info = "John Doe,Manager"
    john_doe = Employee.from_string(employee_info)
    print(john_doe.name)      # Виведе: John Doe
    print(john_doe.position)  # Виведе: Manager
#==============================================================================================
"""
Різниця між статичними та класовими методами полягає в тому, 
* що статичні методи використовуються для функцій, які не потребують доступу до атрибутів або методів класу, 
тоді як класові методи мають доступ до класу та його атрибутів, дозволяючи змінювати стан класу або створювати екземпляри класу за допомогою альтернативних конструкторів.

Статичні методи не мають доступу до стану класу і не можуть його змінювати, 
в той час як класові методи можуть змінювати стан класу.
"""
#==============================================================================================
