"""
        ! метод __repr__ !
* Це метод, який визначає "офіційне" представлення об'єкта. 
Він призначений для розробників і повинен повертати рядок, який містить інформацію, що допомагає ідентифікувати об'єкт.
* призначений для створення однозначного рядкового представлення об'єкта, що може бути корисним під час налагодження.
"""
#==============================================================================================
"""
* Цей метод в Python використовується для представлення об'єкта у вигляді рядка, який має бути унікальним і зрозумілим для розробника. 
Він зазвичай повертає рядок, що містить інформацію про об'єкт, яка допомагає у відладці або логуванні.

* Цей метод призначений для створення офіційного рядкового представлення об'єкта. 
Розробники використовують його для однозначного ідентифікування об'єкта або навіть для відтворення об'єкта в іншому місці коду.

* Цей метод дозволяє розробникам отримати детальне представлення об'єкта, яке може бути використане для точного відтворення об'єкта або для налагодження програми, допомагаючи ідентифікувати та виправляти помилки.
"""
#==============================================================================================
class Point:
    def __init__(self, x, y):
        self.x = x
        self.y = y

    def __repr__(self):
        return f"Point(x={self.x}, y={self.y})"

point = Point(2, 3)
print(repr(point))  # Виводить: Point(x=2, y=3)
#==============================================================================================
class Point:
    def __init__(self, x: float, y: float):
        self.x = x
        self.y = y

    def __repr__(self):
        return f"Point(x={self.x}, y={self.y})"

original_point = Point(2, 3)
print(repr(original_point))  
# Point(x=2, y=3)

# Використання рядка, повернутого __repr__, для створення нового об'єкта
new_point = eval(repr(original_point))
print(new_point)
# Point(x=2, y=3)
#==============================================================================================