"""
        ! Магічні методи!
Це методи, що відповідають за визначену поведінку об'єктів при використанні операторів або інших синтаксичних конструкцій.
"""
#=====================================================================================================
"""
Важливо пам'ятати, що імена всіх магічних методів в Python дотримуються строгої номенклатури: 
* вони складаються з літер нижнього регістру та символів підкреслення, 
* починаються і закінчуються подвійним символом підкреслення (__).
"""
#=====================================================================================================
"""
    ! метод __init__ !
Це магічний метод, який ми найчастіше використовуємо. 
Цей метод відповідає за ініціалізацію об'єкта. 
Він викликається автоматично під час створення нового екземпляра класу.
"""
#=====================================================================================================
class Human:
    def __init__(self, name: str, age: int = 0):
        self.name = name
        self.age = age

    def say_hello(self) -> str:
        return f'Hello! I am {self.name}'

bill = Human('Bill')
print(bill.say_hello())
print(bill.age)

jill = Human('Jill', 20)
print(jill.say_hello())
print(jill.age)

"""
Hello! I am Bill
0
Hello! I am Jill
20
"""
#=====================================================================================================
class Human:
    def __init__(self, name: str, age: int = 0):
        self.name = name
        self.age = age
        # Виклик методу під час ініціалізації
        self.is_adult = self.__check_adulthood()  
        
        # Приклад логування
        print(f"Створено Human: {self.name}, Вік: {self.age}, Дорослий: {self.is_adult}")

    def say_hello(self) -> str:
        return f'Hello! I am {self.name}'

    def __check_adulthood(self) -> bool:
        return self.age >= 18

bill = Human('Bill')
print(bill.say_hello())
print(f"Вік: {bill.age}, Дорослий: {bill.is_adult}")

jill = Human('Jill', 20)
print(jill.say_hello())
print(f"Вік: {jill.age}, Дорослий: {jill.is_adult}")

"""
Створено Human: Bill, Вік: 0, Дорослий: False
Hello! I am Bill
Вік: 0, Дорослий: False
Створено Human: Jill, Вік: 20, Дорослий: True
Hello! I am Jill
Вік: 20, Дорослий: True
"""
#==============================================================================================
