num = 15  # приклад значення для num

if num > 10:
    print("num більше за 10")
else:
    print("num не більше за 10")
#============================================================================
x = int(input('Введіть число: '))

if x % 2 == 0:
    print("Число x є парним.")
else:
    print("Число x є непарним.")

#============================================================================
a = input('Введіть число:')
a = int(a)
if a > 0:
    print('Число додатне')
elif a < 0:
    print("Число від'ємне")
else:
    print('Це число - нуль')

#============================================================================
a = input('Введіть число')
a = int(a)

if a == 1:
    print('Число дорівнює 1')
elif a > 0:
    print('Число додатне')
else:
    print("a <= 0")

#============================================================================
money = 0
if money:
    print(f"You have {money} on your bank account")
else:
    print("You have no money and no debts")

#============================================================================
result = None
if result:
    print(result)
else:
    print("Result is None, do something")

#============================================================================
user_name = input("Enter your name: ")

if user_name:
    print(f"Hello {user_name}")
else:
    print("Hi Anonym!")

#============================================================================
"""
Правило перше - число 0 приводиться до False (ціле, дійсне або комплексне).
Правило друге - значення None приводиться до False. 
Правило третє - порожній контейнер, порожній рядок тощо, приводиться до False. 
Правило останнє - все інше приводиться до True

"""
