#============================================================================
a = [1, 2, 3]
b = a
c = [1, 2, 3]

print(a is b)  # True
print(a is c)  # False
#============================================================================
name = "Taras"
age = 12
has_driver_licence = True

if name and age >= 18 and has_driver_licence:
    print(f"User {name} can rent a car")
else:
    print(f"User {name} cannot rent a car")

#============================================================================
num = int(input("Введіть число: "))

length = len(str(num))

if length == 2 and num % 2 == 0:
    print("Парне двозначне число")
else:
    print("Ні")

#============================================================================
# Задаємо конкретне число
num = int(input())

# Перевіряємо кратність
if num % 3 == 0 and num % 5 == 0:
    print("FizzBuzz")
elif num % 3 == 0:
    print("Fizz")
elif num % 5 == 0:
    print("Buzz")
else:
    print(num)

#============================================================================
x = int(input("X: "))
y = int(input("Y: "))

if x == 0:
    print("X can`t be equal to zero")
    x = int(input("X: "))

result = y / x
print(f"Result: {result}")
#============================================================================
if x >= 0:
    if y >= 0:  # x > 0, y > 0
        print("Перша чверть")
    else:  # x > 0, y < 0
        print("Четверта чверть")
else:
    if y >= 0:  # x < 0, y > 0
        print("Друга чверть")
    else:  # x < 0, y < 0
        print("Третя чверть")

#============================================================================
            #Тернарні операції
#============================================================================
is_nice = True
state = "nice" if is_nice else "not nice"

#============================================================================
is_nice = True
if is_nice:
    state = "nice"
else:
    state = "not nice"

#============================================================================
some_data = None
msg = some_data or "Не було повернено даних"

#============================================================================
some_data = None
if some_data:
    msg = some_data
else:
    msg = "Не було повернено даних"
#============================================================================
