#============================================================================
# Local #
#============================================================================
x = 50

def func() -> None:
    x = 2
    print('Зміна локального x на', x)  # Зміна локального x на 2

func()
print('Глобальний x як і раніше', x)  # x як і раніше 50

#============================================================================
# Охоплювана (Enclosing) область #
#============================================================================
def outer_func():
    enclosing_var = "Я змінна в функції, що охоплює"

    def inner_func():
        print("Всередині вкладеної функції:", enclosing_var)

    inner_func()

outer_func()

#============================================================================
def func_outer():
    x = 2

    def func_inner():
        nonlocal x
        x = 5

    func_inner()
    return x

result = func_outer()  # 5
print("Значення x після виклику вкладеної функції:", result)  
# Значення x після виклику вкладеної функції: 5
# Глобальна область #

#============================================================================
# Global #
#============================================================================
x = 50

def func():
    global x
    print('x дорівнює', x)  # x дорівнює 50
    x = 2
    print('Змінюємо глобальне значення x на', x)  # Змінюємо глобальне значення x на 2

func()
print('Значення x складає', x)  # Значення x складає 2


