"""
range(stop): Створює послідовність чисел від 0 до stop - 1.
range(start, stop): Генерує числа від start до stop - 1.
range(start, stop, step): Створює числа від start до stop - 1, з кроком step.
"""
#============================================================================
for i in range(5):
    print(i)

#============================================================================
for i in range(2, 10):
    print(i)

#============================================================================
for i in range(0, 10, 2):
    print(i)

#============================================================================
"""
Функція enumerate використовується для одночасного отримання індексу та значення елементів ітерованого об'єкта. Вона повертає ітератор, який генерує кортежі, де перший елемент - це індекс, а другий - відповідне значення з ітерованого об'єкта.
"""
#============================================================================
some_list = ["apple", "banana", "cherry"]
for index, value in enumerate(some_list):
    print(index, value)

#============================================================================
"""
Функція zip використовується для ітерації по декількох ітерованих об'єктах одночасно. Вона "застібає" елементи з кожного ітерованого об'єкта, створюючи кортежі з цих елементів.
"""
#============================================================================
list1 = ["зелене", "стигла", "червоний"]
list2 = ["яблуко", "вишня", "томат"]
for number, letter in zip(list1, list2):
    print(number, letter)

#============================================================================
list1 = [1, 2, 3]
list2 = ['a', 'b', 'c', 'd', 'e']

for number, letter in zip(list1, list2):
    print(number, letter)

#============================================================================
numbers = {
    1: "one",
    2: "two",
    3: "three"
}
for key, value in zip(numbers.keys(), numbers.values()):
    print(key, value)
    
#============================================================================
numbers = {
    1: "one",
    2: "two",
    3: "three"
}
for key in numbers:
    print(key)
for key in numbers.keys():
    print(key)
for val in numbers.values():
    print(val)
for key, value in numbers.items():
    print(key, value)
