"""
Цикл while у Python — це один із способів організації циклічного виконання коду. 
Він продовжує виконувати блок інструкцій, поки задана умова залишається істинною. 
Цикл while часто використовується, коли кількість ітерацій заздалегідь невідома або коли ітерації залежать від змінних, які можуть бути модифіковані в процесі виконання циклу.

while condition:
    # Блок коду для виконання
"""

#============================================================================
k = 0
while k < 10:
    k = k + 1
print(k)
