"""
Цикл for в Python використовується для ітерації по елементах будь-якої послідовності (наприклад, списку, кортежу, рядка) або інших ітерованих об'єктів;
він дозволяє виконувати блок коду для кожного елемента послідовності.

for element in sequence:
    # виконувати дії з element
    pass
"""
#============================================================================
"""
Цикл while виконує блок коду, поки задана умова є істинною (True). Як тільки умова стає неправдивою (False), цикл закінчується.

while condition:
    # виконувати дії, поки condition є True
    pass
"""
#============================================================================
fruit = 'apple'
for char in fruit:
    print(char)

#============================================================================
alphabet = "abcdefghijklmnopqrstuvwxyz"
for char in alphabet:
    print(char, end=" ")

#============================================================================
some_iterable = ["a", "b", "c"]

for i in some_iterable:
    print(i)

#============================================================================
odd_numbers = [1, 3, 5, 7, 9]
for i in odd_numbers:
    print(i ** 2)

#============================================================================
# Зчитування рядка від користувача
user_input = input("Введіть рядок: ")

# Ініціалізація змінних для підрахунку символів та пробілів
total_chars = len(user_input)  # загальна кількість символів у рядку
space_count = 0  # кількість пробілів

# Підрахунок кількості пробілів
for char in user_input:
    if char == " ":
        space_count += 1

# Виведення результатів
print(f"Загальна кількість символів у рядку: {total_chars}")
print(f"Кількість пробілів у рядку: {space_count}")
