"""
random.randint(a, b). Він повертає випадкове ціле число N таке, що a <= N <= b
"""
#====================================================================================
import random

dice_roll = random.randint(1, 6)
print(f"Ви кинули {dice_roll}")
#====================================================================================
"""
генерує випадкове дійсне число між 0.0 (включно) та 1.0 (не включно)
"""
#====================================================================================
import random

num = random.random()
print(num)
#====================================================================================
import random

fill_percentage = random.random() * 100
print(f"Заповнення: {fill_percentage:.2f}%")
#====================================================================================
"""
start - нижня межа діапазону (включно). Це початкове значення, з якого може починатися випадковий вибір. Якщо не вказано, за замовчуванням приймається нуль, і діапазон починається з 0.
stop - верхня межа діапазону (не включно). Це означає, що вибране випадкове число буде меншим, ніж це значення. Цей параметр є обов'язковим, і метод не буде працювати без нього.
step - крок між можливими значеннями. Наприклад, якщо встановити step як 2, метод буде вибирати лише парні числа або числа, кратні 2, в залежності від start. Цей параметр є необов'язковим і за замовчуванням дорівнює 1, що означає, що вибір відбувається з усіх послідовних чисел у діапазоні.
"""
#====================================================================================
import random

print(random.randrange(10))  # Верхня межа є 10, але не включається
print(random.randrange(1, 10, 2))  # Вибір непарних чисел від 1 до 9
#====================================================================================
import random

target = random.randrange(1, 11, 2)
print(f"Ціль: {target}")
#====================================================================================
import random

cards = ["Туз", "Король", "Дама", "Валет", "10", "9", "8", "7", "6"]
random.shuffle(cards)
print(f"Перемішана колода: {cards}")
#====================================================================================
import random

fruits = ['apple', 'banana', 'orange']
print(random.choice(fruits))
#====================================================================================
import random

items = ['яблуко', 'банан', 'вишня', 'диня']
chosen_item = random.choices(items, k=1)
print(chosen_item)  
#====================================================================================
import random

colors = ['червоний', 'зелений', 'синій']
weights = [10, 1, 1]
chosen_color = random.choices(colors, weights, k=1)
print(chosen_color)  
#====================================================================================
import random

participants = ['Анна', 'Богдан', 'Віктор', 'Галина', 'Дмитро', 'Олена', 'Женя', 'Зорян', 'Ігор', 'Йосип']
team = random.sample(participants, 4)
print(f"Команда: {team}")
#====================================================================================
import random

price = random.uniform(50, 100)
print(f"Випадкова ціна: {price:.2f} грн.")
#====================================================================================

