import time

current_time = time.time()
print(f"Поточний час: {current_time}")
# Виведе щось на кшталт "Поточний час: 1617183600.123456" (кількість секунд з 1970-01-01 00:00:00 UTC)  
#====================================================================================
import time

print("Початок паузи")
time.sleep(5)
print("Кінець паузи")
# Програма зробить паузу на 5 секунд між двома повідомленнями
#====================================================================================
import time

current_time = time.time()
print(f"Поточний час: {current_time}")

readable_time = time.ctime(current_time)
print(f"Читабельний час: {readable_time}")
# Виведе щось на кшталт "Читабельний час: Mon Mar 30 12:00:00 2021"     
#====================================================================================
import time

current_time = time.time()
print(f"Поточний час: {current_time}")

local_time = time.localtime(current_time)
print(f"Місцевий час: {local_time}")
# Виведе щось на кшталт "Місцевий час: time.struct_time(tm_year=2021, tm_mon=3, tm_mday=30, tm_hour=12, tm_min=0, tm_sec=0, tm_wday=1, tm_yday=89, tm_isdst=0)"
#====================================================================================
"""
tm_year - рік
tm_mon - місяць від 1 до 12
tm_mday - день місяця від 1 до 31
tm_hour - години від 0 до 23
tm_min - хвилини від 0 до 59
tm_sec - секунди від 0 до 59
tm_wday - день тижня від 0 до 6
tm_yday - день року від 1 до 366
tm_isdst - прапорець літнього часу. 
0 означає, що літній час не діє, 
-1 - інформація відсутня, 1 - літній час діє
"""
#====================================================================================
import time

# Записуємо час на початку виконання
start_time = time.perf_counter()

# Виконуємо якусь операцію
for _ in range(1_000_000):
    pass  # Просто проходить цикл мільйон разів

# Записуємо час після виконання операції
end_time = time.perf_counter()

# Розраховуємо та виводимо час виконання
execution_time = end_time - start_time
print(f"Час виконання: {execution_time} секунд")
# Виведе щось на кшталт "Час виконання: 0.123456 секунд"
#====================================================================================
# Один мільйон
a = 1_000_000
print(a)  # Виведе 1000000

# Десять мільйонів
b = 10_000_000
print(b)  # Виведе 10000000

# Один мільярд
c = 1_000_000_000
print(c)  # Виведе 1000000000
#====================================================================================
